<img src='https://storage.googleapis.com/kaggle-datasets-images/2289007/3846912/ad5e128929f5ac26133b67a6110de7c0/dataset-cover.jpg?t=2022-06-22-14-33-45' alt='image' style="display: block; margin: auto;" width='600' height='350'>

<p style="background-color:romance; color:jaguar; font-size:250%; text-align:center; border-radius:10px 10px; font-family:newtimeroman; line-height: 1.4; text-transform: uppercase;"><strong>Data Analysis & Visualization with Python</strong></p>

<p style="background-color:romance; color:jaguar; font-size:200%; text-align:center; border-radius:10px 10px; font-family:newtimeroman; line-height: 1.4; text-transform: title;"><strong>Analysis of Credit Score Classification</strong></p>

<p style="background-color:romance; color:jaguar; font-size:200%; text-align:center; border-radius:10px 10px; font-family:newtimeroman; line-height: 1.1;">Project Solution: Data Cleaning</p>

<a id="content"></a>
<p style="background-color:plum; color:floralwhite; font-size:175%; text-align:center; border-radius:10px 10px; font-family:newtimeroman; line-height: 1.4;"><b>Content</b></p>

* [Introduction](#0)
* [About Dataset](#1)
* [Importing Related Libraries](#2)
* [Recognizing & Understanding Data](#3)
* [Handling with Missing Values](#7)
* [Handling with Outliers](#8)    
* [The End of the Project](#10)

<a id="0"></a>
<p style="background-color:plum; color:floralwhite; font-size:175%; text-align:center; border-radius:10px 10px; font-family:newtimeroman; line-height: 1.4;"><b>Introduction</b></p>

<a href="#content" class="btn btn-primary btn-sm" role="button" aria-pressed="true" style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

One of the most important components to any data science experiment that doesn’t get as much importance as it should is **``Exploratory Data Analysis (EDA)``**. In short, EDA is **``"A first look at the data"``**. It is a critical step in analyzing the data from an experiment. It is used to understand and summarize the content of the dataset to ensure that the features which we feed to our machine learning algorithms are refined and we get valid, correctly interpreted results.
In general, looking at a column of numbers or a whole spreadsheet and determining the important characteristics of the data can be very tedious and boring. Moreover, it is **good practice to understand the problem statement** and the data before you get your hands dirty, which in view, **helps to gain a lot of insights**.

<a id="1"></a>
<p style="background-color:plum; color:floralwhite; font-size:175%; text-align:center; border-radius:10px 10px; font-family:newtimeroman; line-height: 1.4;"><b>About Dataset</b></p>

<a href="https://www.kaggle.com/datasets/parisrohan/credit-score-classification" class="btn btn-primary btn-sm" role="button" aria-pressed="true" style="color:blue; background-color:#dfa8e4" data-toggle="popover">Kaggle: Credit Score Classification</a>

**Problem Statement**
You are working as a data scientist in a global finance company. Over the years, the company has collected basic bank details and gathered a lot of credit-related information. The management wants to build an intelligent system to segregate the people into credit score brackets to reduce the manual efforts.

**Task**
Given a person’s credit-related information, build a machine learning model that can classify the credit score.

<a id="2"></a>
<p style="background-color:plum; color:floralwhite; font-size:175%; text-align:center; border-radius:10px 10px; font-family:newtimeroman; line-height: 1.4;"><b>Importing Related Libraries</b></p>

<a href="#content" class="btn btn-primary btn-sm" role="button" aria-pressed="true" style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

- Once you've Installed NumPy and Pandas etc. you can Import them as a Library.
- Reading the Data from File

In [1]:
import re
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Statistics functions
from scipy import stats

import warnings
# Suppressing a warning 
warnings.filterwarnings("ignore") 
warnings.warn("this will not show")

# Environment settings: 
pd.set_option('display.float_format', lambda x: '%.3f' % x)
# Set it to None to display all columns in the dataframe
pd.set_option('display.max_columns', None)
# Set it None to display all rows in the dataframe
pd.set_option('display.max_rows', 100)

# It is a magic function that renders the figure in the notebook
# Attention if U use this inline Command not work 'figure.figsize'
# %matplotlib inline

## Reading the Data from File

In [2]:
df_origin_train = pd.read_csv('./train.csv')
df_train = df_origin_train.copy()
df_train.head(3)

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,Num_Credit_Card,Interest_Rate,Num_of_Loan,Type_of_Loan,Delay_from_due_date,Num_of_Delayed_Payment,Changed_Credit_Limit,Num_Credit_Inquiries,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score
0,0x1602,CUS_0xd40,January,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843,3,4,3,4,"Auto Loan, Credit-Builder Loan, Personal Loan,...",3,7,11.27,4.000,_,809.98,26.823,22 Years and 1 Months,No,49.575,80.41529543900253,High_spent_Small_value_payments,312.49408867943663,Good
1,0x1603,CUS_0xd40,February,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,NaN,3,4,3,4,"Auto Loan, Credit-Builder Loan, Personal Loan,...",-1,NaN,11.27,4.000,Good,809.98,31.945,NaN,No,49.575,118.28022162236736,Low_spent_Large_value_payments,284.62916249607184,Good
2,0x1604,CUS_0xd40,March,Aaron Maashoh,-500,821-00-0265,Scientist,19114.12,NaN,3,4,3,4,"Auto Loan, Credit-Builder Loan, Personal Loan,...",3,7,_,4.000,Good,809.98,28.609,22 Years and 3 Months,No,49.575,81.699521264648,Low_spent_Medium_value_payments,331.2098628537912,Good

In [3]:
df_origin_test = pd.read_csv('./test.csv')
df_test = df_origin_test.copy()
df_test.head(3)

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,Num_Credit_Card,Interest_Rate,Num_of_Loan,Type_of_Loan,Delay_from_due_date,Num_of_Delayed_Payment,Changed_Credit_Limit,Num_Credit_Inquiries,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance
0,0x160a,CUS_0xd40,September,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843,3,4,3,4,"Auto Loan, Credit-Builder Loan, Personal Loan,...",3,7,11.27,2022.000,Good,809.98,35.030,22 Years and 9 Months,No,49.575,236.64268203272135,Low_spent_Small_value_payments,186.26670208571772
1,0x160b,CUS_0xd40,October,Aaron Maashoh,24,821-00-0265,Scientist,19114.12,1824.843,3,4,3,4,"Auto Loan, Credit-Builder Loan, Personal Loan,...",3,9,13.27,4.000,Good,809.98,33.053,22 Years and 10 Months,No,49.575,21.465380264657146,High_spent_Medium_value_payments,361.44400385378196
2,0x160c,CUS_0xd40,November,Aaron Maashoh,24,821-00-0265,Scientist,19114.12,1824.843,3,4,3,4,"Auto Loan, Credit-Builder Loan, Personal Loan,...",-1,4,12.27,4.000,Good,809.98,33.812,NaN,No,49.575,148.23393788500925,Low_spent_Medium_value_payments,264.67544623342997

<a id="3"></a>
<p style="background-color:plum; color:floralwhite; font-size:175%; text-align:center; border-radius:10px 10px; font-family:newtimeroman; line-height: 1.4;"><b>Recognizing and Understanding Data</b></p>

<a href="#content" class="btn btn-primary btn-sm" role="button" aria-pressed="true" style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

01. Reading the Data from File
02. Try to understand what the data looks like
03. Examining the Data
04. Fixing a data type
05. Combining object columns

## Try to understand what the data looks like
- Check the head, shape, data-types of the features.
- Check if there are some dublicate rows or not. If there are, then drop them. 
- Check the statistical values of features.
- Basically check the missing values. (NaN, None)
- If needed, rename the columns' names for easy use.

### Check the head, shape, data-types of the features.

In [4]:
df_train.shape, df_test.shape

((100000, 28), (50000, 27))

In [5]:
display(
    df_train.info(), 
    print(), 
    df_test.info()
)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 28 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   ID                        100000 non-null  object
 1   Customer_ID               100000 non-null  object
 2   Month                     100000 non-null  object
 3   Name                      90015 non-null   object
 4   Age                       100000 non-null  object
 5   SSN                       100000 non-null  object
 6   Occupation                100000 non-null  object
 7   Annual_Income             100000 non-null  object
 8   Monthly_Inhand_Salary     84998 non-null   float64
 9   Num_Bank_Accounts         100000 non-null  int64
 10  Num_Credit_Card           100000 non-null  int64
 11  Interest_Rate             100000 non-null  int64
 12  Num_of_Loan               100000 non-null  object
 13  Type_of_Loan              88592 non-null   object
 14  Delay_from_due_date       100000 non-null  int64
 15  Num_of_Delayed_Payment    92998 non-null   object
 16  Changed_Credit_Limit      100000 non-null  object
 17  Num_Credit_Inquiries      98035 non-null   float64
 18  Credit_Mix                100000 non-null  object
 19  Outstanding_Debt          100000 non-null  object
 20  Credit_Utilization_Ratio  100000 non-null  float64
 21  Credit_History_Age        90970 non-null   object
 22  Payment_of_Min_Amount     100000 non-null  object
 23  Total_EMI_per_month       100000 non-null  float64
 24  Amount_invested_monthly   95521 non-null   object
 25  Payment_Behaviour         100000 non-null  object
 26  Monthly_Balance           98800 non-null   object
 27  Credit_Score              100000 non-null  object
dtypes: float64(4), int64(4), object(20)
memory usage: 21.4+ MB

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 27 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   ID                        50000 non-null  object
 1   Customer_ID               50000 non-null  object
 2   Month                     50000 non-null  object
 3   Name                      44985 non-null  object
 4   Age                       50000 non-null  object
 5   SSN                       50000 non-null  object
 6   Occupation                50000 non-null  object
 7   Annual_Income             50000 non-null  object
 8   Monthly_Inhand_Salary     42502 non-null  float64
 9   Num_Bank_Accounts         50000 non-null  int64
 10  Num_Credit_Card           50000 non-null  int64
 11  Interest_Rate             50000 non-null  int64
 12  Num_of_Loan               50000 non-null  object
 13  Type_of_Loan              44296 non-null  object
 14  Delay_from_due_date       50000 non-null  int64
 15  Num_of_Delayed_Payment    46502 non-null  object
 16  Changed_Credit_Limit      50000 non-null  object
 17  Num_Credit_Inquiries      48965 non-null  float64
 18  Credit_Mix                50000 non-null  object
 19  Outstanding_Debt          50000 non-null  object
 20  Credit_Utilization_Ratio  50000 non-null  float64
 21  Credit_History_Age        45530 non-null  object
 22  Payment_of_Min_Amount     50000 non-null  object
 23  Total_EMI_per_month       50000 non-null  float64
 24  Amount_invested_monthly   47729 non-null  object
 25  Payment_Behaviour         50000 non-null  object
 26  Monthly_Balance           49438 non-null  object
dtypes: float64(4), int64(4), object(19)
memory usage: 10.3+ MB

None

None

None

* Firstly, the training set as approximately have 2 times the test  sample size. 

* Secondly, It's worth noticing that the test set contains one veraible less than the training set. Obviously, we might suspect that this variable is "Credit_Score" since our purpose is to predict its value based on the test set. Consequently, our training set is a labeled one setting up a supervised learning framework. 

* Finally, the raw data displayed reveals that there are some quasi-constant Features: One of the values is dominant. No worries, we will certainly tackle this issue later on while processing numerical features. 

But at this point, let's clean data, and then continue check the second claim using the next commands.

### Check if there are some dublicate rows or not. If there are, then drop them.

In [6]:
display(
    df_train.duplicated().value_counts(), 
    print(), 
    df_test.duplicated().value_counts()
)

False    100000
dtype: int64

None

False    50000
dtype: int64

### Check the statistical values of features.

In [7]:
display(
    df_train.describe().T, 
    print(), 
    df_test.describe().T
)

,count,mean,std,min,25%,50%,75%,max
Monthly_Inhand_Salary,84998.000,4194.171,3183.686,303.645,1625.568,3093.745,5957.448,15204.633
Num_Bank_Accounts,100000.000,17.091,117.405,-1.000,3.000,6.000,7.000,1798.000
Num_Credit_Card,100000.000,22.474,129.057,0.000,4.000,5.000,7.000,1499.000
Interest_Rate,100000.000,72.466,466.423,1.000,8.000,13.000,20.000,5797.000
Delay_from_due_date,100000.000,21.069,14.860,-5.000,10.000,18.000,28.000,67.000
Num_Credit_Inquiries,98035.000,27.754,193.177,0.000,3.000,6.000,9.000,2597.000
Credit_Utilization_Ratio,100000.000,32.285,5.117,20.000,28.053,32.306,36.497,50.000
Total_EMI_per_month,100000.000,1403.118,8306.041,0.000,30.307,69.249,161.224,82331.000

None

,count,mean,std,min,25%,50%,75%,max
Monthly_Inhand_Salary,42502.000,4182.004,3174.109,303.645,1625.188,3086.305,5934.189,15204.633
Num_Bank_Accounts,50000.000,16.838,116.397,-1.000,3.000,6.000,7.000,1798.000
Num_Credit_Card,50000.000,22.921,129.315,0.000,4.000,5.000,7.000,1499.000
Interest_Rate,50000.000,68.773,451.602,1.000,8.000,13.000,20.000,5799.000
Delay_from_due_date,50000.000,21.053,14.860,-5.000,10.000,18.000,28.000,67.000
Num_Credit_Inquiries,48965.000,30.080,196.984,0.000,4.000,7.000,10.000,2593.000
Credit_Utilization_Ratio,50000.000,32.280,5.106,20.510,28.061,32.280,36.469,48.541
Total_EMI_per_month,50000.000,1491.304,8595.648,0.000,32.222,74.733,176.157,82398.000

In [8]:
display(
    df_train.describe(exclude=np.number).T, 
    print(), 
    df_test.describe(exclude=np.number).T
)

,count,unique,top,freq
ID,100000,100000,0x1602,1
Customer_ID,100000,12500,CUS_0xd40,8
Month,100000,8,January,12500
Name,90015,10139,Langep,44
Age,100000,1788,38,2833
SSN,100000,12501,#F%$D@*&8,5572
Occupation,100000,16,_______,7062
Annual_Income,100000,18940,36585.12,16
Num_of_Loan,100000,434,3,14386
Type_of_Loan,88592,6260,Not Specified,1408
Num_of_Delayed_Payment,92998,749,19,5327
Changed_Credit_Limit,100000,4384,_,2091
Credit_Mix,100000,4,Standard,36479
Outstanding_Debt,100000,13178,1360.45,24
Credit_History_Age,90970,404,15 Years and 11 Months,446
Payment_of_Min_Amount,100000,3,Yes,52326
Amount_invested_monthly,95521,91049,__10000__,4305
Payment_Behaviour,100000,7,Low_spent_Small_value_payments,25513
Monthly_Balance,98800,98792,__-333333333333333333333333333__,9
Credit_Score,100000,3,Standard,53174

None

                         count unique                               top   freq
ID                       50000  50000                            0x160a      1
Customer_ID              50000  12500                         CUS_0xd40      4
Month                    50000      4                         September  12500
Name                     44985  10139                            Stevex     22
Age                      50000    976                                39   1493
SSN                      50000  12501                         #F%$D@*&8   2828
Occupation               50000     16                           _______   3438
Annual_Income            50000  16121                         109945.32      8
Num_of_Loan              50000    263                                 2   7173
Type_of_Loan             44296   6260                     Not Specified    704
Num_of_Delayed_Payment   46502    443                                19   2622
Changed_Credit_Limit     50000   3927                                 _   1059
Credit_Mix               50000      4                          Standard  18379
Outstanding_Debt         50000  12685                           1109.03     12
Credit_History_Age       45530    399             20 Years and 1 Months    254
Payment_of_Min_Amount    50000      3                               Yes  26158
Amount_invested_monthly  47729  45450                         __10000__   2175
Payment_Behaviour        50000      7    Low_spent_Small_value_payments  12694
Monthly_Balance          49438  49433  __-333333333333333333333333333__      6

### Basically check the missing values. (NaN, None)-(isna(), mean())

In [9]:
display(
    df_train.isna().sum(), 
    print(), 
    df_test.isna().sum()
)

ID                              0
Customer_ID                     0
Month                           0
Name                         9985
Age                             0
SSN                             0
Occupation                      0
Annual_Income                   0
Monthly_Inhand_Salary       15002
Num_Bank_Accounts               0
Num_Credit_Card                 0
Interest_Rate                   0
Num_of_Loan                     0
Type_of_Loan                11408
Delay_from_due_date             0
Num_of_Delayed_Payment       7002
Changed_Credit_Limit            0
Num_Credit_Inquiries         1965
Credit_Mix                      0
Outstanding_Debt                0
Credit_Utilization_Ratio        0
Credit_History_Age           9030
Payment_of_Min_Amount           0
Total_EMI_per_month             0
Amount_invested_monthly      4479
Payment_Behaviour               0
Monthly_Balance              1200
Credit_Score                    0
dtype: int64

None

ID                             0
Customer_ID                    0
Month                          0
Name                        5015
Age                            0
SSN                            0
Occupation                     0
Annual_Income                  0
Monthly_Inhand_Salary       7498
Num_Bank_Accounts              0
Num_Credit_Card                0
Interest_Rate                  0
Num_of_Loan                    0
Type_of_Loan                5704
Delay_from_due_date            0
Num_of_Delayed_Payment      3498
Changed_Credit_Limit           0
Num_Credit_Inquiries        1035
Credit_Mix                     0
Outstanding_Debt               0
Credit_Utilization_Ratio       0
Credit_History_Age          4470
Payment_of_Min_Amount          0
Total_EMI_per_month            0
Amount_invested_monthly     2271
Payment_Behaviour              0
Monthly_Balance              562
dtype: int64

In [10]:
display(
    df_train.isnull().mean()*100, 
    print(), 
    df_test.isnull().mean()*100
)

ID                          0.000
Customer_ID                 0.000
Month                       0.000
Name                        9.985
Age                         0.000
SSN                         0.000
Occupation                  0.000
Annual_Income               0.000
Monthly_Inhand_Salary      15.002
Num_Bank_Accounts           0.000
Num_Credit_Card             0.000
Interest_Rate               0.000
Num_of_Loan                 0.000
Type_of_Loan               11.408
Delay_from_due_date         0.000
Num_of_Delayed_Payment      7.002
Changed_Credit_Limit        0.000
Num_Credit_Inquiries        1.965
Credit_Mix                  0.000
Outstanding_Debt            0.000
Credit_Utilization_Ratio    0.000
Credit_History_Age          9.030
Payment_of_Min_Amount       0.000
Total_EMI_per_month         0.000
Amount_invested_monthly     4.479
Payment_Behaviour           0.000
Monthly_Balance             1.200
Credit_Score                0.000
dtype: float64

None

ID                          0.000
Customer_ID                 0.000
Month                       0.000
Name                       10.030
Age                         0.000
SSN                         0.000
Occupation                  0.000
Annual_Income               0.000
Monthly_Inhand_Salary      14.996
Num_Bank_Accounts           0.000
Num_Credit_Card             0.000
Interest_Rate               0.000
Num_of_Loan                 0.000
Type_of_Loan               11.408
Delay_from_due_date         0.000
Num_of_Delayed_Payment      6.996
Changed_Credit_Limit        0.000
Num_Credit_Inquiries        2.070
Credit_Mix                  0.000
Outstanding_Debt            0.000
Credit_Utilization_Ratio    0.000
Credit_History_Age          8.940
Payment_of_Min_Amount       0.000
Total_EMI_per_month         0.000
Amount_invested_monthly     4.542
Payment_Behaviour           0.000
Monthly_Balance             1.124
dtype: float64

### If needed, rename the columns' names for easy use.

In [11]:
display(
    df_train.columns, 
    print(), 
    df_test.columns
)

Index(['ID', 'Customer_ID', 'Month', 'Name', 'Age', 'SSN', 'Occupation',
       'Annual_Income', 'Monthly_Inhand_Salary', 'Num_Bank_Accounts',
       'Num_Credit_Card', 'Interest_Rate', 'Num_of_Loan', 'Type_of_Loan',
       'Delay_from_due_date', 'Num_of_Delayed_Payment', 'Changed_Credit_Limit',
       'Num_Credit_Inquiries', 'Credit_Mix', 'Outstanding_Debt',
       'Credit_Utilization_Ratio', 'Credit_History_Age',
       'Payment_of_Min_Amount', 'Total_EMI_per_month',
       'Amount_invested_monthly', 'Payment_Behaviour', 'Monthly_Balance',
       'Credit_Score'],
      dtype='object')

None

Index(['ID', 'Customer_ID', 'Month', 'Name', 'Age', 'SSN', 'Occupation',
       'Annual_Income', 'Monthly_Inhand_Salary', 'Num_Bank_Accounts',
       'Num_Credit_Card', 'Interest_Rate', 'Num_of_Loan', 'Type_of_Loan',
       'Delay_from_due_date', 'Num_of_Delayed_Payment', 'Changed_Credit_Limit',
       'Num_Credit_Inquiries', 'Credit_Mix', 'Outstanding_Debt',
       'Credit_Utilization_Ratio', 'Credit_History_Age',
       'Payment_of_Min_Amount', 'Total_EMI_per_month',
       'Amount_invested_monthly', 'Payment_Behaviour', 'Monthly_Balance'],
      dtype='object')

## Examining the Data
- Look at the counts of columns that have OBJECT datatype 
- Assign the Columns (Features) of object data type as** **`"object_col"`**
- Detect strange values apart from the NaN Values.(isin(),Count(),Sum(),Any())

### Look at the value counts of columns that have OBJECT datatype

In [12]:
display(
    df_train.select_dtypes('O').info(), 
    print(), 
    df_test.select_dtypes('O').info()
)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 20 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   ID                       100000 non-null  object
 1   Customer_ID              100000 non-null  object
 2   Month                    100000 non-null  object
 3   Name                     90015 non-null   object
 4   Age                      100000 non-null  object
 5   SSN                      100000 non-null  object
 6   Occupation               100000 non-null  object
 7   Annual_Income            100000 non-null  object
 8   Num_of_Loan              100000 non-null  object
 9   Type_of_Loan             88592 non-null   object
 10  Num_of_Delayed_Payment   92998 non-null   object
 11  Changed_Credit_Limit     100000 non-null  object
 12  Credit_Mix               100000 non-null  object
 13  Outstanding_Debt         100000 non-null  object
 14  Credit_History_Age       90970 non-null   object
 15  Payment_of_Min_Amount    100000 non-null  object
 16  Amount_invested_monthly  95521 non-null   object
 17  Payment_Behaviour        100000 non-null  object
 18  Monthly_Balance          98800 non-null   object
 19  Credit_Score             100000 non-null  object
dtypes: object(20)
memory usage: 15.3+ MB

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 19 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   ID                       50000 non-null  object
 1   Customer_ID              50000 non-null  object
 2   Month                    50000 non-null  object
 3   Name                     44985 non-null  object
 4   Age                      50000 non-null  object
 5   SSN                      50000 non-null  object
 6   Occupation               50000 non-null  object
 7   Annual_Income            50000 non-null  object
 8   Num_of_Loan              50000 non-null  object
 9   Type_of_Loan             44296 non-null  object
 10  Num_of_Delayed_Payment   46502 non-null  object
 11  Changed_Credit_Limit     50000 non-null  object
 12  Credit_Mix               50000 non-null  object
 13  Outstanding_Debt         50000 non-null  object
 14  Credit_History_Age       45530 non-null  object
 15  Payment_of_Min_Amount    50000 non-null  object
 16  Amount_invested_monthly  47729 non-null  object
 17  Payment_Behaviour        50000 non-null  object
 18  Monthly_Balance          49438 non-null  object
dtypes: object(19)
memory usage: 7.2+ MB

None

None

None

### Assign the Columns (Features) of object data type as** **``"object_col"``

In [13]:
object_col_train = df_train.describe(include='O').columns
object_col_test = df_test.describe(include='O').columns

In [14]:
for col in object_col_train:
    print('Column Name: '+col)
    print("**"*20)
    print(df_train[col].value_counts(dropna=False))
    print('END', "--"*18, '\n')

Column Name: ID
****************************************
0x1602     1
0x19c88    1
0x19caa    1
0x19ca5    1
0x19ca4    1
          ..
0xd94d     1
0xd94c     1
0xd94b     1
0xd94a     1
0x25fed    1
Name: ID, Length: 100000, dtype: int64
END ------------------------------------

Column Name: Customer_ID
****************************************
CUS_0xd40     8
CUS_0x9bf4    8
CUS_0x5ae3    8
CUS_0xbe9a    8
CUS_0x4874    8
             ..
CUS_0x2eb4    8
CUS_0x7863    8
CUS_0x9d89    8
CUS_0xc045    8
CUS_0x942c    8
Name: Customer_ID, Length: 12500, dtype: int64
END ------------------------------------

Column Name: Month
****************************************
January     12500
February    12500
March       12500
April       12500
May         12500
June        12500
July        12500
August      12500
Name: Month, dtype: int64
END ------------------------------------

Column Name: Name
****************************************
NaN               9985
Stevex              44
Langep              44
Jessicad            39
Vaughanl            39
                  ...
Robin Pomeroyz       4
Matt Scuffhamk       4
Julieno              4
Bavierq              4
Timothyl             3
Name: Name, Length: 10140, dtype: int64
END ------------------------------------

Column Name: Age
****************************************
38      2833
28      2829
31      2806
26      2792
32      2749
        ...
471        1
1520       1
8663       1
3363       1
1342       1
Name: Age, Length: 1788, dtype: int64
END ------------------------------------

Column Name: SSN
****************************************
#F%$D@*&8      5572
078-73-5990       8
486-78-3816       8
750-67-7525       8
903-50-0305       8
               ...
856-06-6147       4
753-72-2651       4
331-28-1921       4
604-62-6133       4
286-44-9634       4
Name: SSN, Length: 12501, dtype: int64
END ------------------------------------

Column Name: Occupation
****************************************
_______          7062
Lawyer           6575
Architect        6355
Engineer         6350
Scientist        6299
Mechanic         6291
Accountant       6271
Developer        6235
Media_Manager    6232
Teacher          6215
Entrepreneur     6174
Doctor           6087
Journalist       6085
Manager          5973
Musician         5911
Writer           5885
Name: Occupation, dtype: int64
END ------------------------------------

Column Name: Annual_Income
****************************************
36585.12     16
20867.67     16
17273.83     16
9141.63      15
33029.66     15
             ..
20269.93_     1
15157.25_     1
44955.64_     1
76650.12_     1
4262933.0     1
Name: Annual_Income, Length: 18940, dtype: int64
END ------------------------------------

Column Name: Num_of_Loan
****************************************
3        14386
2        14250
4        14016
0        10380
1        10083
         ...
1320_        1
103          1
1444         1
392          1
966          1
Name: Num_of_Loan, Length: 434, dtype: int64
END ------------------------------------

Column Name: Type_of_Loan
****************************************
NaN                                                                                                                                   11408
Not Specified                                                                                                                          1408
Credit-Builder Loan                                                                                                                    1280
Personal Loan                                                                                                                          1272
Debt Consolidation Loan                                                                                                                1264
                                                                                                                                      ...
Not Specified, Mortgage Loan, Auto Loan, and Payday Loan                                                                                  8
Payday Loan, Mortgage Loan, Debt Consolidation Loan, and Student Loan                                                                     8
Debt Consolidation Loan, Auto Loan, Personal Loan, Debt Consolidation Loan, Student Loan, and Credit-Builder Loan                         8
Student Loan, Auto Loan, Student Loan, Credit-Builder Loan, Home Equity Loan, Debt Consolidation Loan, and Debt Consolidation Loan        8
Personal Loan, Auto Loan, Mortgage Loan, Student Loan, and Student Loan                                                                   8
Name: Type_of_Loan, Length: 6261, dtype: int64
END ------------------------------------

Column Name: Num_of_Delayed_Payment
****************************************
NaN     7002
19      5327
17      5261
16      5173
10      5153
        ...
848_       1
4134       1
1530       1
1502       1
2047       1
Name: Num_of_Delayed_Payment, Length: 750, dtype: int64
END ------------------------------------

Column Name: Changed_Credit_Limit
****************************************
_                     2091
8.22                   133
11.5                   127
11.32                  126
7.35                   121
                      ...
-1.84                    1
0.8899999999999999       1
28.06                    1
1.5599999999999996       1
21.17                    1
Name: Changed_Credit_Limit, Length: 4384, dtype: int64
END ------------------------------------

Column Name: Credit_Mix
****************************************
Standard    36479
Good        24337
_           20195
Bad         18989
Name: Credit_Mix, dtype: int64
END ------------------------------------

Column Name: Outstanding_Debt
****************************************
1360.45     24
460.46      23
1151.7      23
1109.03     23
467.7       16
            ..
245.46_      1
645.77_      1
174.79_      1
1181.13_     1
1013.53_     1
Name: Outstanding_Debt, Length: 13178, dtype: int64
END ------------------------------------

Column Name: Credit_History_Age
****************************************
NaN                       9030
15 Years and 11 Months     446
19 Years and 4 Months      445
19 Years and 5 Months      444
17 Years and 11 Months     443
                          ...
0 Years and 3 Months        20
0 Years and 2 Months        15
33 Years and 7 Months       14
33 Years and 8 Months       12
0 Years and 1 Months         2
Name: Credit_History_Age, Length: 405, dtype: int64
END ------------------------------------

Column Name: Payment_of_Min_Amount
****************************************
Yes    52326
No     35667
NM     12007
Name: Payment_of_Min_Amount, dtype: int64
END ------------------------------------

Column Name: Amount_invested_monthly
****************************************
NaN                   4479
__10000__             4305
0.0                    169
36.66235139442514        1
89.7384893604547         1
                      ...
36.541908593249026       1
93.45116318631192        1
140.80972223052834       1
38.73937670100975        1
167.1638651610451        1
Name: Amount_invested_monthly, Length: 91050, dtype: int64
END ------------------------------------

Column Name: Payment_Behaviour
****************************************
Low_spent_Small_value_payments      25513
High_spent_Medium_value_payments    17540
Low_spent_Medium_value_payments     13861
High_spent_Large_value_payments     13721
High_spent_Small_value_payments     11340
Low_spent_Large_value_payments      10425
!@9#%8                               7600
Name: Payment_Behaviour, dtype: int64
END ------------------------------------

Column Name: Monthly_Balance
****************************************
NaN                                 1200
__-333333333333333333333333333__       9
312.49408867943663                     1
347.413889978152                       1
254.9709216273975                      1
                                    ...
366.2890379762706                      1
151.1882696261166                      1
306.75027851710234                     1
278.8720257394474                      1
393.6736955618808                      1
Name: Monthly_Balance, Length: 98793, dtype: int64
END ------------------------------------

Column Name: Credit_Score
****************************************
Standard    53174
Poor        28998
Good        17828
Name: Credit_Score, dtype: int64
END ------------------------------------

In [15]:
for col in object_col_test:
    print('Column Name: '+col)
    print("**"*20)
    print(df_test[col].value_counts(dropna=False))
    print('END', "--"*18, '\n')

Column Name: ID
****************************************
0x160a     1
0x19cd8    1
0x19c9a    1
0x19c9b    1
0x19c9c    1
          ..
0xd95e     1
0xd95f     1
0xd960     1
0xd961     1
0x25ff1    1
Name: ID, Length: 50000, dtype: int64
END ------------------------------------

Column Name: Customer_ID
****************************************
CUS_0xd40     4
CUS_0x9bf4    4
CUS_0x5ae3    4
CUS_0xbe9a    4
CUS_0x4874    4
             ..
CUS_0x2eb4    4
CUS_0x7863    4
CUS_0x9d89    4
CUS_0xc045    4
CUS_0x942c    4
Name: Customer_ID, Length: 12500, dtype: int64
END ------------------------------------

Column Name: Month
****************************************
September    12500
October      12500
November     12500
December     12500
Name: Month, dtype: int64
END ------------------------------------

Column Name: Name
****************************************
NaN                   5015
Stevex                  22
Langep                  21
Deepa Seetharamanm      20
Nicko                   20
                      ...
Nicolaq                  1
Alexei Oreskovicn        1
Herbert Lashx            1
Sarah N.y                1
Timf                     1
Name: Name, Length: 10140, dtype: int64
END ------------------------------------

Column Name: Age
****************************************
39      1493
32      1440
44      1428
22      1422
35      1414
        ...
437        1
1419       1
120        1
2552       1
4975       1
Name: Age, Length: 976, dtype: int64
END ------------------------------------

Column Name: SSN
****************************************
#F%$D@*&8      2828
821-00-0265       4
756-60-6274       4
089-19-7596       4
905-14-5788       4
               ...
332-96-0334       1
611-21-4406       1
326-89-0421       1
789-15-7049       1
715-49-4883       1
Name: SSN, Length: 12501, dtype: int64
END ------------------------------------

Column Name: Occupation
****************************************
_______          3438
Lawyer           3324
Engineer         3212
Architect        3195
Mechanic         3168
Developer        3146
Accountant       3133
Media_Manager    3130
Scientist        3104
Teacher          3103
Entrepreneur     3103
Journalist       3037
Doctor           3027
Manager          3000
Musician         2947
Writer           2933
Name: Occupation, dtype: int64
END ------------------------------------

Column Name: Annual_Income
****************************************
109945.32    8
17816.75     8
95596.35     8
72524.2      8
9141.63      8
            ..
28056.94_    1
28286.24_    1
1716646.0    1
10622.485    1
62160.87_    1
Name: Annual_Income, Length: 16121, dtype: int64
END ------------------------------------

Column Name: Num_of_Loan
****************************************
2        7173
3        7114
4        6982
0        5163
1        5029
         ...
621         1
1040        1
1496        1
570         1
1296_       1
Name: Num_of_Loan, Length: 263, dtype: int64
END ------------------------------------

Column Name: Type_of_Loan
****************************************
NaN                                                                                                                                   5704
Not Specified                                                                                                                          704
Credit-Builder Loan                                                                                                                    640
Personal Loan                                                                                                                          636
Debt Consolidation Loan                                                                                                                632
                                                                                                                                      ...
Not Specified, Mortgage Loan, Auto Loan, and Payday Loan                                                                                 4
Payday Loan, Mortgage Loan, Debt Consolidation Loan, and Student Loan                                                                    4
Debt Consolidation Loan, Auto Loan, Personal Loan, Debt Consolidation Loan, Student Loan, and Credit-Builder Loan                        4
Student Loan, Auto Loan, Student Loan, Credit-Builder Loan, Home Equity Loan, Debt Consolidation Loan, and Debt Consolidation Loan       4
Personal Loan, Auto Loan, Mortgage Loan, Student Loan, and Student Loan                                                                  4
Name: Type_of_Loan, Length: 6261, dtype: int64
END ------------------------------------

Column Name: Num_of_Delayed_Payment
****************************************
NaN     3498
19      2622
15      2594
18      2570
16      2548
        ...
288        1
3556       1
3393       1
4351       1
2034       1
Name: Num_of_Delayed_Payment, Length: 444, dtype: int64
END ------------------------------------

Column Name: Changed_Credit_Limit
****************************************
_                      1059
11.5                     70
11.32                    63
7.01                     60
7.35                     60
                       ...
-0.6099999999999999       1
21.61                     1
12.010000000000002        1
0.43000000000000016       1
29.17                     1
Name: Changed_Credit_Limit, Length: 3927, dtype: int64
END ------------------------------------

Column Name: Credit_Mix
****************************************
Standard    18379
Good        12260
_            9805
Bad          9556
Name: Credit_Mix, dtype: int64
END ------------------------------------

Column Name: Outstanding_Debt
****************************************
1109.03     12
1360.45     12
460.46      12
1151.7      12
1319.87      8
            ..
1443.78_     1
3534.9_      1
4320.49_     1
2982.66_     1
3223.66_     1
Name: Outstanding_Debt, Length: 12685, dtype: int64
END ------------------------------------

Column Name: Credit_History_Age
****************************************
NaN                       4470
20 Years and 1 Months      254
16 Years and 1 Months      254
19 Years and 7 Months      252
18 Years and 7 Months      252
                          ...
4 Years and 5 Months        21
0 Years and 11 Months       16
33 Years and 11 Months      15
34 Years and 0 Months       14
0 Years and 10 Months       13
Name: Credit_History_Age, Length: 400, dtype: int64
END ------------------------------------

Column Name: Payment_of_Min_Amount
****************************************
Yes    26158
No     17849
NM      5993
Name: Payment_of_Min_Amount, dtype: int64
END ------------------------------------

Column Name: Amount_invested_monthly
****************************************
NaN                   2271
__10000__             2175
0.0                    106
75.97604257809586        1
320.4566446914704        1
                      ...
197.2171314766754        1
366.23148415217315       1
34.89940643392877        1
256.90830529853173       1
220.45787812168732       1
Name: Amount_invested_monthly, Length: 45451, dtype: int64
END ------------------------------------

Column Name: Payment_Behaviour
****************************************
Low_spent_Small_value_payments      12694
High_spent_Medium_value_payments     8922
High_spent_Large_value_payments      6844
Low_spent_Medium_value_payments      6837
High_spent_Small_value_payments      5651
Low_spent_Large_value_payments       5252
!@9#%8                               3800
Name: Payment_Behaviour, dtype: int64
END ------------------------------------

Column Name: Monthly_Balance
****************************************
NaN                                 562
__-333333333333333333333333333__      6
186.26670208571772                    1
449.82938730504236                    1
389.53754307843735                    1
                                   ...
421.25686767906984                    1
194.44026842190848                    1
299.957837924029                      1
375.897928536186                      1
360.37968260123847                    1
Name: Monthly_Balance, Length: 49434, dtype: int64
END ------------------------------------

### Detect strange values apart from the NaN Values.(isin(),Count(),Sum(),Any())

In [16]:
def df_Cleaner(df):
    columns = df.dtypes.to_dict()
    for col, types in columns.items():
        if types == object:
            df[col] = df[col].apply(lambda x: x if x is np.NaN else str(x).strip('_ ,"')
                ).replace(['', 'nan', '!@9#%8', '#F%$D@*&8'], np.NaN)
    return df

In [17]:
df_train = df_Cleaner(df_train)
df_test = df_Cleaner(df_test)

In [18]:
# Or
# df_train = df_train.applymap(lambda x: x if x is np.NaN or not isinstance(x, str) else str(x).strip('_ ,"')).replace(['', 'nan', '!@9#%8', '#F%$D@*&8'], np.NaN)
# df_test = df_test.applymap(lambda x: x if x is np.NaN or not isinstance(x, str) else str(x).strip('_ ,"')).replace(['', 'nan', '!@9#%8', '#F%$D@*&8'], np.NaN)

In [19]:
display(
    df_train.isna().sum(), 
    print(), 
    df_test.isna().sum()
)

ID                              0
Customer_ID                     0
Month                           0
Name                         9985
Age                             0
SSN                          5572
Occupation                   7062
Annual_Income                   0
Monthly_Inhand_Salary       15002
Num_Bank_Accounts               0
Num_Credit_Card                 0
Interest_Rate                   0
Num_of_Loan                     0
Type_of_Loan                11408
Delay_from_due_date             0
Num_of_Delayed_Payment       7002
Changed_Credit_Limit         2091
Num_Credit_Inquiries         1965
Credit_Mix                  20195
Outstanding_Debt                0
Credit_Utilization_Ratio        0
Credit_History_Age           9030
Payment_of_Min_Amount           0
Total_EMI_per_month             0
Amount_invested_monthly      4479
Payment_Behaviour            7600
Monthly_Balance              1200
Credit_Score                    0
dtype: int64

None

ID                             0
Customer_ID                    0
Month                          0
Name                        5015
Age                            0
SSN                         2828
Occupation                  3438
Annual_Income                  0
Monthly_Inhand_Salary       7498
Num_Bank_Accounts              0
Num_Credit_Card                0
Interest_Rate                  0
Num_of_Loan                    0
Type_of_Loan                5704
Delay_from_due_date            0
Num_of_Delayed_Payment      3498
Changed_Credit_Limit        1059
Num_Credit_Inquiries        1035
Credit_Mix                  9805
Outstanding_Debt               0
Credit_Utilization_Ratio       0
Credit_History_Age          4470
Payment_of_Min_Amount          0
Total_EMI_per_month            0
Amount_invested_monthly     2271
Payment_Behaviour           3800
Monthly_Balance              562
dtype: int64

In [20]:
display(
    df_train.isna().mean()*100, 
    print(), 
    df_test.isna().mean()*100
)

ID                          0.000
Customer_ID                 0.000
Month                       0.000
Name                        9.985
Age                         0.000
SSN                         5.572
Occupation                  7.062
Annual_Income               0.000
Monthly_Inhand_Salary      15.002
Num_Bank_Accounts           0.000
Num_Credit_Card             0.000
Interest_Rate               0.000
Num_of_Loan                 0.000
Type_of_Loan               11.408
Delay_from_due_date         0.000
Num_of_Delayed_Payment      7.002
Changed_Credit_Limit        2.091
Num_Credit_Inquiries        1.965
Credit_Mix                 20.195
Outstanding_Debt            0.000
Credit_Utilization_Ratio    0.000
Credit_History_Age          9.030
Payment_of_Min_Amount       0.000
Total_EMI_per_month         0.000
Amount_invested_monthly     4.479
Payment_Behaviour           7.600
Monthly_Balance             1.200
Credit_Score                0.000
dtype: float64

None

ID                          0.000
Customer_ID                 0.000
Month                       0.000
Name                       10.030
Age                         0.000
SSN                         5.656
Occupation                  6.876
Annual_Income               0.000
Monthly_Inhand_Salary      14.996
Num_Bank_Accounts           0.000
Num_Credit_Card             0.000
Interest_Rate               0.000
Num_of_Loan                 0.000
Type_of_Loan               11.408
Delay_from_due_date         0.000
Num_of_Delayed_Payment      6.996
Changed_Credit_Limit        2.118
Num_Credit_Inquiries        2.070
Credit_Mix                 19.610
Outstanding_Debt            0.000
Credit_Utilization_Ratio    0.000
Credit_History_Age          8.940
Payment_of_Min_Amount       0.000
Total_EMI_per_month         0.000
Amount_invested_monthly     4.542
Payment_Behaviour           7.600
Monthly_Balance             1.124
dtype: float64

## Fixing a data type (value_counts(), astype())

- Assign Object Types to Numeric Types
- Convert Object Types to Numeric Types (int, float, np.int64, pd.Int64Dtype())

In [21]:
display(df_train.select_dtypes('O').info(), print(), df_test.select_dtypes('O').info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 20 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   ID                       100000 non-null  object
 1   Customer_ID              100000 non-null  object
 2   Month                    100000 non-null  object
 3   Name                     90015 non-null   object
 4   Age                      100000 non-null  object
 5   SSN                      94428 non-null   object
 6   Occupation               92938 non-null   object
 7   Annual_Income            100000 non-null  object
 8   Num_of_Loan              100000 non-null  object
 9   Type_of_Loan             88592 non-null   object
 10  Num_of_Delayed_Payment   92998 non-null   object
 11  Changed_Credit_Limit     97909 non-null   object
 12  Credit_Mix               79805 non-null   object
 13  Outstanding_Debt         100000 non-null  object
 14  Credit_History_Age       90970 non-null   object
 15  Payment_of_Min_Amount    100000 non-null  object
 16  Amount_invested_monthly  95521 non-null   object
 17  Payment_Behaviour        92400 non-null   object
 18  Monthly_Balance          98800 non-null   object
 19  Credit_Score             100000 non-null  object
dtypes: object(20)
memory usage: 15.3+ MB

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 19 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   ID                       50000 non-null  object
 1   Customer_ID              50000 non-null  object
 2   Month                    50000 non-null  object
 3   Name                     44985 non-null  object
 4   Age                      50000 non-null  object
 5   SSN                      47172 non-null  object
 6   Occupation               46562 non-null  object
 7   Annual_Income            50000 non-null  object
 8   Num_of_Loan              50000 non-null  object
 9   Type_of_Loan             44296 non-null  object
 10  Num_of_Delayed_Payment   46502 non-null  object
 11  Changed_Credit_Limit     48941 non-null  object
 12  Credit_Mix               40195 non-null  object
 13  Outstanding_Debt         50000 non-null  object
 14  Credit_History_Age       45530 non-null  object
 15  Payment_of_Min_Amount    50000 non-null  object
 16  Amount_invested_monthly  47729 non-null  object
 17  Payment_Behaviour        46200 non-null  object
 18  Monthly_Balance          49438 non-null  object
dtypes: object(19)
memory usage: 7.2+ MB

None

None

None

### Convert Object Types to Numeric Types (int, float, np.int64, pd.Int64Dtype())

In [22]:
df_train['ID'] = df_train.ID.apply(lambda x: int(x, 16))
df_test['ID'] = df_test.ID.apply(lambda x: int(x, 16))

In [23]:
df_train['Customer_ID'] = df_train.Customer_ID.apply(lambda x: int(x[4:], 16))
df_test['Customer_ID'] = df_test.Customer_ID.apply(lambda x: int(x[4:], 16))

In [24]:
df_train['Month'] = pd.to_datetime(df_train.Month, format='%B').dt.month
df_test['Month'] = pd.to_datetime(df_test.Month, format='%B').dt.month

In [25]:
df_train['Age'] = df_train.Age.astype(int)        
df_test['Age'] = df_test.Age.astype(int)

In [26]:
df_train['SSN'] = df_train.SSN.apply(lambda x: x if x is np.NaN else int(str(x).replace('-', ''))).astype(float)
df_test['SSN'] = df_test.SSN.apply(lambda x: x if x is np.NaN else int(str(x).replace('-', ''))).astype(float)

In [27]:
df_train['Annual_Income'] = df_train.Annual_Income.astype(float)
df_test['Annual_Income'] = df_test.Annual_Income.astype(float)

In [28]:
df_train['Num_of_Loan'] = df_train.Num_of_Loan.astype(int) 
df_test['Num_of_Loan'] = df_test.Num_of_Loan.astype(int)

In [29]:
df_train['Num_of_Delayed_Payment'] = df_train.Num_of_Delayed_Payment.astype(float)
df_test['Num_of_Delayed_Payment'] = df_test.Num_of_Delayed_Payment.astype(float)

In [30]:
df_train['Changed_Credit_Limit'] = df_train.Changed_Credit_Limit.astype(float)
df_test['Changed_Credit_Limit'] = df_test.Changed_Credit_Limit.astype(float)

In [31]:
df_train['Outstanding_Debt'] = df_train.Outstanding_Debt.astype(float)
df_test['Outstanding_Debt'] = df_test.Outstanding_Debt.astype(float)

In [32]:
df_train['Amount_invested_monthly'] = df_train.Amount_invested_monthly.astype(float)
df_test['Amount_invested_monthly'] = df_test.Amount_invested_monthly.astype(float)

In [33]:
df_train['Monthly_Balance'] = df_train.Monthly_Balance.astype(float)
df_test['Monthly_Balance'] = df_test.Monthly_Balance.astype(float)

### Assign Categorical Types to Numeric Types

- Use Before Machine Learning

In [34]:
# df_train['Occupation_Num'] = df_train.Occupation.astype('category').cat.codes
# df_test['Occupation_Num'] = df_test.Occupation.astype('category').cat.codes

In [35]:
# df_train['Credit_Mix_Num'] = df_train.Credit_Mix.astype('category').cat.codes
# df_test['Credit_Mix_Num'] = df_test.Credit_Mix.astype('category').cat.codes

In [36]:
# df_train['Payment_of_Min_Amount_Num'] = df_train.Payment_of_Min_Amount.astype('category').cat.codes
# df_test['Payment_of_Min_Amount_Num'] = df_test.Payment_of_Min_Amount.astype('category').cat.codes

In [37]:
# df_train['Payment_Behaviour_Num'] = df_train.Payment_Behaviour.astype('category').cat.codes
# df_test['Payment_Behaviour_Num'] = df_test.Payment_Behaviour.astype('category').cat.codes

In [38]:
# Not equired
# df_train['Credit_Score_Num'] = df_train.Credit_Score.astype('category').cat.codes

## Combining object columns
- Example: If the date and time of  are stored in separate object columns. Then combine these two columns into a single column, and then convert it to datetime format.

In [39]:
def Month_Converter(x):
    if pd.notnull(x):
        num1 = int(x.split(' ')[0])
        num2 = int(x.split(' ')[3])
      
        return num1*12+num2
    else:
        return x
    
# Month_Converter('3 Years and 1 Months')

In [40]:
df_train['Credit_History_Age'] = df_train.Credit_History_Age.apply(lambda x: Month_Converter(x)).astype(float)
df_test['Credit_History_Age'] = df_test.Credit_History_Age.apply(lambda x: Month_Converter(x)).astype(float)

In [41]:
df_train.groupby('Customer_ID')['Credit_History_Age'].apply(list)

Customer_ID
1006     [182.0, 183.0, 184.0, 185.0, 186.0, 187.0, 188...
1007     [346.0, 347.0, 348.0, 349.0, 350.0, nan, 352.0...
1008     [292.0, 293.0, 294.0, nan, 296.0, 297.0, 298.0...
1009     [331.0, 332.0, 333.0, 334.0, 335.0, 336.0, 337...
1011     [179.0, 180.0, nan, 182.0, 183.0, 184.0, 185.0...
                               ...
50984    [157.0, 158.0, 159.0, nan, 161.0, 162.0, nan, ...
50990       [70.0, 71.0, 72.0, nan, nan, 75.0, 76.0, 77.0]
50992    [159.0, 160.0, 161.0, 162.0, 163.0, nan, 165.0...
50996    [206.0, 207.0, 208.0, 209.0, 210.0, 211.0, 212...
50999    [226.0, 227.0, 228.0, 229.0, 230.0, 231.0, 232...
Name: Credit_History_Age, Length: 12500, dtype: object

In [42]:
df_train.groupby('Customer_ID')['Type_of_Loan'].value_counts(dropna=False)

Customer_ID  Type_of_Loan
1006         Credit-Builder Loan, and Payday Loan                                                                     8
1007         Home Equity Loan, Mortgage Loan, and Student Loan                                                        8
1008         NaN                                                                                                      8
1009         Credit-Builder Loan, Student Loan, Not Specified, and Student Loan                                       8
1011         Personal Loan, Auto Loan, and Auto Loan                                                                  8
                                                                                                                     ..
50984        Home Equity Loan, Mortgage Loan, Payday Loan, Mortgage Loan, Mortgage Loan, and Payday Loan              8
50990        Mortgage Loan, Auto Loan, and Auto Loan                                                                  8
50992        Student Loan, Credit-Builder Loan, Mortgage Loan, Payday Loan, Home Equity Loan, and Home Equity Loan    8
50996        NaN                                                                                                      8
50999        Credit-Builder Loan                                                                                      8
Name: Type_of_Loan, Length: 12500, dtype: int64

In [43]:
df_train.groupby('Customer_ID')['Type_of_Loan'].apply(list)

Customer_ID
1006     [Credit-Builder Loan, and Payday Loan, Credit-...
1007     [Home Equity Loan, Mortgage Loan, and Student ...
1008              [nan, nan, nan, nan, nan, nan, nan, nan]
1009     [Credit-Builder Loan, Student Loan, Not Specif...
1011     [Personal Loan, Auto Loan, and Auto Loan, Pers...
                               ...
50984    [Home Equity Loan, Mortgage Loan, Payday Loan,...
50990    [Mortgage Loan, Auto Loan, and Auto Loan, Mort...
50992    [Student Loan, Credit-Builder Loan, Mortgage L...
50996             [nan, nan, nan, nan, nan, nan, nan, nan]
50999    [Credit-Builder Loan, Credit-Builder Loan, Cre...
Name: Type_of_Loan, Length: 12500, dtype: object

In [44]:
def get_Diff_Values_Colum(df_column, diff_value = []):   
    column = df_column.dropna()
    for i in column:
        if ',' not in i and i not in diff_value:
            diff_value.append(i)
        else:
            for data in map(lambda x:x.strip(), i.replace('and','').split(',')):
                if not data in diff_value:
                    diff_value.append(data)
    return dict(enumerate(sorted(diff_value)))

In [45]:
display(
    get_Diff_Values_Colum(df_train['Type_of_Loan']), 
    print(), 
    get_Diff_Values_Colum(df_test['Type_of_Loan'])
)

{0: 'Auto Loan',
 1: 'Credit-Builder Loan',
 2: 'Debt Consolidation Loan',
 3: 'Home Equity Loan',
 4: 'Mortgage Loan',
 5: 'Not Specified',
 6: 'Payday Loan',
 7: 'Personal Loan',
 8: 'Student Loan'}

None

{0: 'Auto Loan',
 1: 'Credit-Builder Loan',
 2: 'Debt Consolidation Loan',
 3: 'Home Equity Loan',
 4: 'Mortgage Loan',
 5: 'Not Specified',
 6: 'Payday Loan',
 7: 'Personal Loan',
 8: 'Student Loan'}

In [46]:
display(
    df_train.info(), 
    print(), 
    df_test.info()
)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 28 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   ID                        100000 non-null  int64
 1   Customer_ID               100000 non-null  int64
 2   Month                     100000 non-null  int64
 3   Name                      90015 non-null   object
 4   Age                       100000 non-null  int32
 5   SSN                       94428 non-null   float64
 6   Occupation                92938 non-null   object
 7   Annual_Income             100000 non-null  float64
 8   Monthly_Inhand_Salary     84998 non-null   float64
 9   Num_Bank_Accounts         100000 non-null  int64
 10  Num_Credit_Card           100000 non-null  int64
 11  Interest_Rate             100000 non-null  int64
 12  Num_of_Loan               100000 non-null  int32
 13  Type_of_Loan              88592 non-null   object
 14  Delay_from_due_date       100000 non-null  int64
 15  Num_of_Delayed_Payment    92998 non-null   float64
 16  Changed_Credit_Limit      97909 non-null   float64
 17  Num_Credit_Inquiries      98035 non-null   float64
 18  Credit_Mix                79805 non-null   object
 19  Outstanding_Debt          100000 non-null  float64
 20  Credit_Utilization_Ratio  100000 non-null  float64
 21  Credit_History_Age        90970 non-null   float64
 22  Payment_of_Min_Amount     100000 non-null  object
 23  Total_EMI_per_month       100000 non-null  float64
 24  Amount_invested_monthly   95521 non-null   float64
 25  Payment_Behaviour         92400 non-null   object
 26  Monthly_Balance           98800 non-null   float64
 27  Credit_Score              100000 non-null  object
dtypes: float64(12), int32(2), int64(7), object(7)
memory usage: 20.6+ MB

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 27 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   ID                        50000 non-null  int64
 1   Customer_ID               50000 non-null  int64
 2   Month                     50000 non-null  int64
 3   Name                      44985 non-null  object
 4   Age                       50000 non-null  int32
 5   SSN                       47172 non-null  float64
 6   Occupation                46562 non-null  object
 7   Annual_Income             50000 non-null  float64
 8   Monthly_Inhand_Salary     42502 non-null  float64
 9   Num_Bank_Accounts         50000 non-null  int64
 10  Num_Credit_Card           50000 non-null  int64
 11  Interest_Rate             50000 non-null  int64
 12  Num_of_Loan               50000 non-null  int32
 13  Type_of_Loan              44296 non-null  object
 14  Delay_from_due_date       50000 non-null  int64
 15  Num_of_Delayed_Payment    46502 non-null  float64
 16  Changed_Credit_Limit      48941 non-null  float64
 17  Num_Credit_Inquiries      48965 non-null  float64
 18  Credit_Mix                40195 non-null  object
 19  Outstanding_Debt          50000 non-null  float64
 20  Credit_Utilization_Ratio  50000 non-null  float64
 21  Credit_History_Age        45530 non-null  float64
 22  Payment_of_Min_Amount     50000 non-null  object
 23  Total_EMI_per_month       50000 non-null  float64
 24  Amount_invested_monthly   47729 non-null  float64
 25  Payment_Behaviour         46200 non-null  object
 26  Monthly_Balance           49438 non-null  float64
dtypes: float64(12), int32(2), int64(7), object(6)
memory usage: 9.9+ MB

None

None

None

## Detect Outliers and Fill NaN Values

### Reassign Group in Wrong Object Column

In [47]:
display(
    df_train.describe(include='O').T, 
    print(), 
    df_test.describe(include='O').T
)

                        count unique                             top   freq
Name                    90015  10128                          Langep     44
Occupation              92938     15                          Lawyer   6575
Type_of_Loan            88592   6260                   Not Specified   1408
Credit_Mix              79805      3                        Standard  36479
Payment_of_Min_Amount  100000      3                             Yes  52326
Payment_Behaviour       92400      6  Low_spent_Small_value_payments  25513
Credit_Score           100000      3                        Standard  53174

None

                       count unique                             top   freq
Name                   44985  10128                          Stevex     22
Occupation             46562     15                          Lawyer   3324
Type_of_Loan           44296   6260                   Not Specified    704
Credit_Mix             40195      3                        Standard  18379
Payment_of_Min_Amount  50000      3                             Yes  26158
Payment_Behaviour      46200      6  Low_spent_Small_value_payments  12694

In [48]:
df_test.groupby('Customer_ID')['Name'].apply(list)

Customer_ID
1006      [nan, Matthias Blamontb, nan, Matthias Blamontb]
1007       [Soyoung Kimu, Soyoung Kimu, nan, Soyoung Kimu]
1008                              [Koht, Koht, Koht, Koht]
1009                                  [Edd, Edd, Edd, nan]
1011                  [nan, Terry Wadeu, Terry Wadeu, nan]
                               ...
50984               [Victoriah, Victoriah, Victoriah, nan]
50990                             [Yueo, Yueo, Yueo, Yueo]
50992    [Jason Langev, Jason Langev, Jason Langev, Jas...
50996                  [Koh Guia, Koh Guia, Koh Guia, nan]
50999    [Simon Johnsong, Simon Johnsong, Simon Johnson...
Name: Name, Length: 12500, dtype: object

In [49]:
df_test['Name'].value_counts(dropna=False).head(1)

NaN    5015
Name: Name, dtype: int64

In [50]:
# Reassign and Show Function
def Reassign_Group_Object_Wrong_Values(df, groupby, column, inplace=True):    
    # Assigning Wrong values Make Simple Function
    def make_NaN_and_fill_mode(df, groupby, column, inplace=True):
        # Assign None to np.NaN
        if df[column].isin([None]).sum():
            df[column][df[column].isin([None])] = np.NaN
            
        # fill with local mode
        result = df.groupby(groupby)[column].transform(lambda x: x.fillna(stats.mode(x)[0][0]))

        # inplace
        if inplace:
            df[column]=result
        else:
            return result
    
    # Run      
    if inplace:  
        # Before Assigning Wrong values      
        x = df[column].value_counts(dropna=False).head(1)
        print(f'\nBefore Assigning NaN {column}:', [x if x.index[0] is np.NaN or x.index[0] is None else 'No NaN Value'] , end='\n')
        a = df.groupby(groupby)[column].apply(list) 
        print(f'\nBefore Assigning Example {column}:\n', *a.head().values, sep='\n', end='\n')
        
        # Assigning
        make_NaN_and_fill_mode(df, groupby, column, inplace)
        
        # After Assigning Wrong values
        y = df[column].value_counts(dropna=False).head(1)
        print(f'\nAfter Assigning NaN {column}:', [y if y.index[0] is np.NaN or x.index[0] is None else 'No NaN Value'] , end='\n')
        b = df.groupby(groupby)[column].apply(list)
        print(f'\nAfter Assigning Example {column}:\n', *b.head().values, sep='\n', end='\n')
    else:   
        # Show
        return make_NaN_and_fill_mode(df, groupby, column, inplace)

In [51]:
# Not Save
Reassign_Group_Object_Wrong_Values(df_train, 'Customer_ID', 'Name', False).value_counts(dropna=False)

Jessicad              48
Langep                48
Stevex                48
Vaughanl              40
Ronald Groverk        40
                      ..
Breidthardtj           8
Sven Egenterx          8
Antonella Ciancioc     8
Valentina Zan          8
Nicks                  8
Name: Name, Length: 10128, dtype: int64

In [52]:
display(
    Reassign_Group_Object_Wrong_Values(df_train, 'Customer_ID', 'Name'), 
    print(), 
    Reassign_Group_Object_Wrong_Values(df_test, 'Customer_ID', 'Name')
)

Before Assigning NaN Name: [NaN    9985
Name: Name, dtype: int64]

Before Assigning Example Name:

['Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', nan]
[nan, 'Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu', nan, nan, 'Soyoung Kimu']
['Koht', 'Koht', 'Koht', 'Koht', 'Koht', 'Koht', 'Koht', nan]
['Edd', 'Edd', 'Edd', 'Edd', 'Edd', 'Edd', 'Edd', 'Edd']
['Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', nan]

After Assigning NaN Name: ['No NaN Value']

After Assigning Example Name:

['Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb']
['Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu']
['Koht', 'Koht', 'Koht', 'Koht', 'Koht', 'Koht', 'Koht', 'Koht']
['Edd', 'Edd', 'Edd', 'Edd', 'Edd', 'Edd', 'Edd', 'Edd']
['Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu']


Before Assigning NaN Name: [NaN    5015
Name: Name, dtype: int64]

Before Assigning Example Name:

[nan, 'Matthias Blamontb', nan, 'Matthias Blamontb']
['Soyoung Kimu', 'Soyoung Kimu', nan, 'Soyoung Kimu']
['Koht', 'Koht', 'Koht', 'Koht']
['Edd', 'Edd', 'Edd', nan]
[nan, 'Terry Wadeu', 'Terry Wadeu', nan]

After Assigning NaN Name: ['No NaN Value']

After Assigning Example Name:

['Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb']
['Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu']
['Koht', 'Koht', 'Koht', 'Koht']
['Edd', 'Edd', 'Edd', 'Edd']
['Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu']

None

None

None

In [53]:
df_train['Occupation'].value_counts(dropna=False)

NaN              7062
Lawyer           6575
Architect        6355
Engineer         6350
Scientist        6299
Mechanic         6291
Accountant       6271
Developer        6235
Media_Manager    6232
Teacher          6215
Entrepreneur     6174
Doctor           6087
Journalist       6085
Manager          5973
Musician         5911
Writer           5885
Name: Occupation, dtype: int64

In [54]:
display(
    Reassign_Group_Object_Wrong_Values(df_train, 'Customer_ID', 'Occupation'), 
    print(), 
    Reassign_Group_Object_Wrong_Values(df_test, 'Customer_ID', 'Occupation')
)

Before Assigning NaN Occupation: [NaN    7062
Name: Occupation, dtype: int64]

Before Assigning Example Occupation:

['Journalist', 'Journalist', 'Journalist', 'Journalist', 'Journalist', nan, 'Journalist', 'Journalist']
['Manager', 'Manager', nan, 'Manager', 'Manager', 'Manager', 'Manager', 'Manager']
['Developer', 'Developer', 'Developer', 'Developer', 'Developer', 'Developer', 'Developer', 'Developer']
['Accountant', nan, 'Accountant', 'Accountant', 'Accountant', 'Accountant', 'Accountant', 'Accountant']
['Writer', 'Writer', 'Writer', 'Writer', nan, 'Writer', 'Writer', 'Writer']

After Assigning NaN Occupation: ['No NaN Value']

After Assigning Example Occupation:

['Journalist', 'Journalist', 'Journalist', 'Journalist', 'Journalist', 'Journalist', 'Journalist', 'Journalist']
['Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager']
['Developer', 'Developer', 'Developer', 'Developer', 'Developer', 'Developer', 'Developer', 'Developer']
['Accountant', 'Accountant', 'Accountant', 'Accountant', 'Accountant', 'Accountant', 'Accountant', 'Accountant']
['Writer', 'Writer', 'Writer', 'Writer', 'Writer', 'Writer', 'Writer', 'Writer']


Before Assigning NaN Occupation: [NaN    3438
Name: Occupation, dtype: int64]

Before Assigning Example Occupation:

['Journalist', 'Journalist', 'Journalist', 'Journalist']
['Manager', 'Manager', 'Manager', 'Manager']
['Developer', 'Developer', 'Developer', 'Developer']
['Accountant', nan, 'Accountant', 'Accountant']
[nan, 'Writer', 'Writer', 'Writer']

After Assigning NaN Occupation: ['No NaN Value']

After Assigning Example Occupation:

['Journalist', 'Journalist', 'Journalist', 'Journalist']
['Manager', 'Manager', 'Manager', 'Manager']
['Developer', 'Developer', 'Developer', 'Developer']
['Accountant', 'Accountant', 'Accountant', 'Accountant']
['Writer', 'Writer', 'Writer', 'Writer']

None

None

None

In [55]:
df_train.groupby('Customer_ID')['Type_of_Loan'].value_counts(dropna=False)

Customer_ID  Type_of_Loan
1006         Credit-Builder Loan, and Payday Loan                                                                     8
1007         Home Equity Loan, Mortgage Loan, and Student Loan                                                        8
1008         NaN                                                                                                      8
1009         Credit-Builder Loan, Student Loan, Not Specified, and Student Loan                                       8
1011         Personal Loan, Auto Loan, and Auto Loan                                                                  8
                                                                                                                     ..
50984        Home Equity Loan, Mortgage Loan, Payday Loan, Mortgage Loan, Mortgage Loan, and Payday Loan              8
50990        Mortgage Loan, Auto Loan, and Auto Loan                                                                  8
50992        Student Loan, Credit-Builder Loan, Mortgage Loan, Payday Loan, Home Equity Loan, and Home Equity Loan    8
50996        NaN                                                                                                      8
50999        Credit-Builder Loan                                                                                      8
Name: Type_of_Loan, Length: 12500, dtype: int64

In [56]:
df_train['Type_of_Loan'].replace([np.NaN], 'No Data', inplace=True)
df_test['Type_of_Loan'].replace([np.NaN], 'No Data', inplace=True)

In [57]:
df_train['Credit_Mix'].value_counts(dropna=False)

Standard    36479
Good        24337
NaN         20195
Bad         18989
Name: Credit_Mix, dtype: int64

In [58]:
display(
    Reassign_Group_Object_Wrong_Values(df_train, 'Customer_ID', 'Credit_Mix'), 
    print(), 
    Reassign_Group_Object_Wrong_Values(df_test, 'Customer_ID', 'Credit_Mix')
)

Before Assigning NaN Credit_Mix: ['No NaN Value']

Before Assigning Example Credit_Mix:

['Standard', 'Standard', 'Standard', 'Standard', 'Standard', nan, 'Standard', 'Standard']
[nan, 'Standard', 'Standard', 'Standard', nan, 'Standard', nan, 'Standard']
[nan, 'Standard', 'Standard', nan, 'Standard', 'Standard', 'Standard', 'Standard']
['Standard', nan, 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard']
[nan, nan, 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard']

After Assigning NaN Credit_Mix: ['No NaN Value']

After Assigning Example Credit_Mix:

['Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard']
['Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard']
['Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard']
['Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard']
['Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard']


Before Assigning NaN Credit_Mix: ['No NaN Value']

Before Assigning Example Credit_Mix:

['Standard', 'Standard', 'Standard', 'Standard']
['Standard', 'Standard', 'Standard', 'Standard']
['Standard', 'Standard', 'Standard', 'Standard']
['Standard', nan, 'Standard', 'Standard']
['Standard', 'Standard', 'Standard', 'Standard']

After Assigning NaN Credit_Mix: ['No NaN Value']

After Assigning Example Credit_Mix:

['Standard', 'Standard', 'Standard', 'Standard']
['Standard', 'Standard', 'Standard', 'Standard']
['Standard', 'Standard', 'Standard', 'Standard']
['Standard', 'Standard', 'Standard', 'Standard']
['Standard', 'Standard', 'Standard', 'Standard']

None

None

None

In [59]:
# Not Required
df_train['Payment_of_Min_Amount'].value_counts(dropna=False)

Yes    52326
No     35667
NM     12007
Name: Payment_of_Min_Amount, dtype: int64

In [60]:
display(
    Reassign_Group_Object_Wrong_Values(df_train, 'Customer_ID', 'Payment_Behaviour'), 
    print(), 
    Reassign_Group_Object_Wrong_Values(df_test, 'Customer_ID', 'Payment_Behaviour')
)

Before Assigning NaN Payment_Behaviour: ['No NaN Value']

Before Assigning Example Payment_Behaviour:

['High_spent_Medium_value_payments', 'Low_spent_Medium_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Small_value_payments', 'Low_spent_Large_value_payments', nan, 'Low_spent_Large_value_payments', 'Low_spent_Small_value_payments']
['High_spent_Medium_value_payments', 'High_spent_Medium_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Medium_value_payments', 'Low_spent_Small_value_payments', nan, 'Low_spent_Small_value_payments', 'Low_spent_Small_value_payments']
['High_spent_Small_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Small_value_payments', 'High_spent_Medium_value_payments', 'High_spent_Small_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Large_value_payments']
['High_spent_Medium_value_payments', 'High_spent_Large_value_payments', 'High_spent_Medium_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Medium_value_payments', 'Low_spent_Large_value_payments', nan, 'High_spent_Large_value_payments']
['High_spent_Small_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Medium_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Medium_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Large_value_payments', 'Low_spent_Medium_value_payments']

After Assigning NaN Payment_Behaviour: ['No NaN Value']

After Assigning Example Payment_Behaviour:

['High_spent_Medium_value_payments', 'Low_spent_Medium_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Small_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Small_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Small_value_payments']
['High_spent_Medium_value_payments', 'High_spent_Medium_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Medium_value_payments', 'Low_spent_Small_value_payments', 'Low_spent_Small_value_payments', 'Low_spent_Small_value_payments', 'Low_spent_Small_value_payments']
['High_spent_Small_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Small_value_payments', 'High_spent_Medium_value_payments', 'High_spent_Small_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Large_value_payments']
['High_spent_Medium_value_payments', 'High_spent_Large_value_payments', 'High_spent_Medium_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Medium_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Large_value_payments', 'High_spent_Large_value_payments']
['High_spent_Small_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Medium_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Medium_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Large_value_payments', 'Low_spent_Medium_value_payments']


Before Assigning NaN Payment_Behaviour: ['No NaN Value']

Before Assigning Example Payment_Behaviour:

['Low_spent_Small_value_payments', 'Low_spent_Medium_value_payments', 'Low_spent_Small_value_payments', 'Low_spent_Small_value_payments']
['Low_spent_Medium_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Small_value_payments', 'Low_spent_Small_value_payments']
['High_spent_Small_value_payments', 'High_spent_Small_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Medium_value_payments']
['Low_spent_Medium_value_payments', 'High_spent_Large_value_payments', 'High_spent_Medium_value_payments', 'High_spent_Medium_value_payments']
['Low_spent_Large_value_payments', 'Low_spent_Medium_value_payments', 'High_spent_Large_value_payments', nan]

After Assigning NaN Payment_Behaviour: ['No NaN Value']

After Assigning Example Payment_Behaviour:

['Low_spent_Small_value_payments', 'Low_spent_Medium_value_payments', 'Low_spent_Small_value_payments', 'Low_spent_Small_value_payments']
['Low_spent_Medium_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Small_value_payments', 'Low_spent_Small_value_payments']
['High_spent_Small_value_payments', 'High_spent_Small_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Medium_value_payments']
['Low_spent_Medium_value_payments', 'High_spent_Large_value_payments', 'High_spent_Medium_value_payments', 'High_spent_Medium_value_payments']
['Low_spent_Large_value_payments', 'Low_spent_Medium_value_payments', 'High_spent_Large_value_payments', 'High_spent_Large_value_payments']

None

None

None

In [61]:
# Not Required
df_train['Credit_Score'].value_counts(dropna=False)

Standard    53174
Poor        28998
Good        17828
Name: Credit_Score, dtype: int64

### Reassign_Group_Numeric_Wrong_Values

In [62]:
display(
    df_train.describe().T, 
    print(), 
    df_test.describe().T
)

,count,mean,std,min,25%,50%,75%,max
ID,100000.000,80631.500,43301.487,5634.000,43132.750,80631.500,118130.250,155629.000
Customer_ID,100000.000,25982.667,14340.543,1006.000,13664.500,25777.000,38385.000,50999.000
Month,100000.000,4.500,2.291,1.000,2.750,4.500,6.250,8.000
Age,100000.000,110.650,686.245,-500.000,24.000,33.000,42.000,8698.000
SSN,94428.000,500368782.100,290649963.555,81349.000,245221682.000,500317991.000,755784922.000,999993421.000
Annual_Income,100000.000,176415.701,1429618.051,7005.930,19457.500,37578.610,72790.920,24198062.000
Monthly_Inhand_Salary,84998.000,4194.171,3183.686,303.645,1625.568,3093.745,5957.448,15204.633
Num_Bank_Accounts,100000.000,17.091,117.405,-1.000,3.000,6.000,7.000,1798.000
Num_Credit_Card,100000.000,22.474,129.057,0.000,4.000,5.000,7.000,1499.000
Interest_Rate,100000.000,72.466,466.423,1.000,8.000,13.000,20.000,5797.000
Num_of_Loan,100000.000,3.010,62.648,-100.000,1.000,3.000,5.000,1496.000
Delay_from_due_date,100000.000,21.069,14.860,-5.000,10.000,18.000,28.000,67.000
Num_of_Delayed_Payment,92998.000,30.923,226.032,-3.000,9.000,14.000,18.000,4397.000
Changed_Credit_Limit,97909.000,10.389,6.789,-6.490,5.320,9.400,14.870,36.970
Num_Credit_Inquiries,98035.000,27.754,193.177,0.000,3.000,6.000,9.000,2597.000
Outstanding_Debt,100000.000,1426.220,1155.129,0.230,566.072,1166.155,1945.963,4998.070
Credit_Utilization_Ratio,100000.000,32.285,5.117,20.000,28.053,32.306,36.497,50.000
Credit_History_Age,90970.000,221.195,99.741,1.000,144.000,219.000,302.000,404.000
Total_EMI_per_month,100000.000,1403.118,8306.041,0.000,30.307,69.249,161.224,82331.000
Amount_invested_monthly,95521.000,637.413,2043.319,0.000,74.534,135.926,265.732,10000.000
Monthly_Balance,98800.000,-30364372469635625254912.000,3181295008379834214645760.000,-333333333333333314856026112.000,270.092,336.719,470.220,1602.041

None

,count,mean,std,min,25%,50%,75%,max
ID,50000.000,80637.500,43301.703,5642.000,43139.750,80637.500,118135.250,155633.000
Customer_ID,50000.000,25982.667,14340.615,1006.000,13664.500,25777.000,38385.000,50999.000
Month,50000.000,10.500,1.118,9.000,9.750,10.500,11.250,12.000
Age,50000.000,109.714,679.696,-500.000,25.000,34.000,43.000,8688.000
SSN,47172.000,500910799.319,290843514.171,81349.000,245499172.000,501079854.000,756411144.000,999993421.000
Annual_Income,50000.000,166334.205,1351965.474,7005.930,19453.327,37577.820,72817.020,24137255.000
Monthly_Inhand_Salary,42502.000,4182.004,3174.109,303.645,1625.188,3086.305,5934.189,15204.633
Num_Bank_Accounts,50000.000,16.838,116.397,-1.000,3.000,6.000,7.000,1798.000
Num_Credit_Card,50000.000,22.921,129.315,0.000,4.000,5.000,7.000,1499.000
Interest_Rate,50000.000,68.773,451.602,1.000,8.000,13.000,20.000,5799.000
Num_of_Loan,50000.000,3.403,66.364,-100.000,1.000,3.000,5.000,1496.000
Delay_from_due_date,50000.000,21.053,14.860,-5.000,10.000,18.000,28.000,67.000
Num_of_Delayed_Payment,46502.000,30.889,221.510,-3.000,9.000,14.000,18.000,4399.000
Changed_Credit_Limit,48941.000,10.375,6.781,-6.450,5.340,9.410,14.800,36.650
Num_Credit_Inquiries,48965.000,30.080,196.984,0.000,4.000,7.000,10.000,2593.000
Outstanding_Debt,50000.000,1426.220,1155.135,0.230,566.072,1166.155,1945.963,4998.070
Credit_Utilization_Ratio,50000.000,32.280,5.106,20.510,28.061,32.280,36.469,48.541
Credit_History_Age,45530.000,227.251,99.554,10.000,151.000,225.000,307.000,408.000
Total_EMI_per_month,50000.000,1491.304,8595.648,0.000,32.222,74.733,176.157,82398.000
Amount_invested_monthly,47729.000,641.655,2053.895,0.000,74.529,135.590,266.892,10000.000
Monthly_Balance,49438.000,-40454710951090252152832.000,3671993981894084417028096.000,-333333333333333314856026112.000,270.474,336.973,470.857,1606.518

In [63]:
display(    
    df_train['ID'].nunique(),
    print(),
    df_test['ID'].nunique()
)

100000

None

50000

In [64]:
display(    
    df_train['Customer_ID'].nunique(),
    print(),
    df_test['Customer_ID'].nunique()
)

12500

None

12500

In [65]:
display(    
    df_train['Month'].value_counts(),
    print(),
    df_test['Month'].value_counts()
)

1    12500
2    12500
3    12500
4    12500
5    12500
6    12500
7    12500
8    12500
Name: Month, dtype: int64

None

9     12500
10    12500
11    12500
12    12500
Name: Month, dtype: int64

In [66]:
# Define Outlier Range
def get_lower_upper(df_column): 
    
    Q1 = df_column.quantile(0.25)
    Q3 = df_column.quantile(0.75)
    iqr = Q3-Q1
    
    lower_lim = Q1 - (1.5*iqr)
    upper_lim = Q3 + (1.5*iqr)
    
    return lower_lim, upper_lim

In [67]:
df_train[df_train.Age.notna()].groupby('Customer_ID')['Age'].apply(list)

Customer_ID
1006     [37, 38, 38, 8153, 38, 38, 38, 38]
1007       [48, 48, 48, 48, 48, 48, 48, 48]
1008     [3452, 37, 37, 37, 37, 37, 37, 37]
1009       [22, 22, 22, 22, 22, 22, 22, 23]
1011       [43, 44, 44, 44, 44, 44, 44, 44]
                        ...
50984      [20, 20, 20, 20, 20, 20, 20, 20]
50990    [38, 38, 4706, 38, 38, 38, 38, 38]
50992      [23, 23, 23, 23, 23, 23, 24, 24]
50996    [3891, 38, 38, 38, 38, 38, 38, 38]
50999      [46, 46, 46, 46, 46, 46, 46, 46]
Name: Age, Length: 12500, dtype: object

In [68]:
# Reassign Wrong Values and Show Function
def Reassign_Group_Numeric_Wrong_Values(df, groupby, column, inplace=True):    

    # Identify Wrong values Range
    def get_group_min_max(df, groupby, column):            
        cur = df[df[column].notna()].groupby(groupby)[column].apply(list)
        x, y = cur.apply(lambda x: stats.mode(x)).apply([min, max])
        return x[0][0], y[0][0]
    
    # Assigning Wrong values
    def make_group_NaN_and_fill_mode(df, groupby, column, inplace=True):
        df_dropped = df[df[column].notna()].groupby(groupby)[column].apply(list)
        x, y = df_dropped.apply(lambda x: stats.mode(x)).apply([min, max])
        mini, maxi = x[0][0], y[0][0]

        # assign Wrong Values to NaN
        col = df[column].apply(lambda x: np.NaN if ((x<mini)|(x>maxi)) else x)

        # fill with local mode
        mode_by_group = df.groupby(groupby)[column].transform(lambda x: x.mode()[0] if not x.mode().empty else np.NaN)
        result = col.fillna(mode_by_group)

        # inplace
        if inplace:
            df[column]=result
        else:
            return result
        
    
    # Run      
    if inplace:   
        print("\nExisting Min, Max Values:", df[column].apply([min, max]), sep='\n', end='\n')       
        mini, maxi = get_group_min_max(df, groupby, column)        
        print(f"\nby {groupby}'s Actual min, max Values:", f'min:\t{mini},\nmax:\t{ maxi}', sep='\n', end='\n')
        
        # Before Assigning Wrong values      
        x = df[column].value_counts(dropna=False).head(1)
        print(f'\nBefore Assigning Min, Max {column}:', [x if x.index[0] is np.NaN or x.index[0] is None else 'No NaN Value'] , end='\n')
        
        a = df.groupby(groupby)[column].apply(list) 
        print(f'\nBefore Assigning Example {column}:\n', *a.head().values, sep='\n', end='\n')
        
        # Assigning
        make_group_NaN_and_fill_mode(df, groupby, column, inplace)
        
        # After Assigning Wrong values
        y = df[column].value_counts(dropna=False).head(1)
        print(f'\nAfter Assigning  Min, Max {column}:', [y if y.index[0] is np.NaN or x.index[0] is None else 'No NaN Value'] , end='\n')
        
        b = df.groupby(groupby)[column].apply(list)
        print(f'\nAfter Assigning Example {column}:\n', *b.head().values, sep='\n', end='\n')
    else:   
        # Show
        return make_group_NaN_and_fill_mode(df, groupby, column, inplace)

In [69]:
df_train.describe().columns

Index(['ID', 'Customer_ID', 'Month', 'Age', 'SSN', 'Annual_Income',
       'Monthly_Inhand_Salary', 'Num_Bank_Accounts', 'Num_Credit_Card',
       'Interest_Rate', 'Num_of_Loan', 'Delay_from_due_date',
       'Num_of_Delayed_Payment', 'Changed_Credit_Limit',
       'Num_Credit_Inquiries', 'Outstanding_Debt', 'Credit_Utilization_Ratio',
       'Credit_History_Age', 'Total_EMI_per_month', 'Amount_invested_monthly',
       'Monthly_Balance'],
      dtype='object')

In [70]:
display(    
    Reassign_Group_Numeric_Wrong_Values(df_train, 'Customer_ID', 'Age'),
    print(),
    Reassign_Group_Numeric_Wrong_Values(df_test, 'Customer_ID', 'Age')
)

Existing Min, Max Values:
min    -500
max    8698
Name: Age, dtype: int64

by Customer_ID's Actual min, max Values:
min:	14,
max:	56

Before Assigning Min, Max Age: ['No NaN Value']

Before Assigning Example Age:

[37, 38, 38, 8153, 38, 38, 38, 38]
[48, 48, 48, 48, 48, 48, 48, 48]
[3452, 37, 37, 37, 37, 37, 37, 37]
[22, 22, 22, 22, 22, 22, 22, 23]
[43, 44, 44, 44, 44, 44, 44, 44]

After Assigning  Min, Max Age: ['No NaN Value']

After Assigning Example Age:

[37.0, 38.0, 38.0, 38.0, 38.0, 38.0, 38.0, 38.0]
[48.0, 48.0, 48.0, 48.0, 48.0, 48.0, 48.0, 48.0]
[37.0, 37.0, 37.0, 37.0, 37.0, 37.0, 37.0, 37.0]
[22.0, 22.0, 22.0, 22.0, 22.0, 22.0, 22.0, 23.0]
[43.0, 44.0, 44.0, 44.0, 44.0, 44.0, 44.0, 44.0]


Existing Min, Max Values:
min    -500
max    8688
Name: Age, dtype: int64

by Customer_ID's Actual min, max Values:
min:	-500,
max:	56

Before Assigning Min, Max Age: ['No NaN Value']

Before Assigning Example Age:

[38, 38, 38, 38]
[48, 48, 48, 49]
[37, 37, 37, 37]
[23, 23, 23, 23]
[44, 44, 44, 44]

After Assigning  Min, Max Age: ['No NaN Value']

After Assigning Example Age:

[38.0, 38.0, 38.0, 38.0]
[48.0, 48.0, 48.0, 49.0]
[37.0, 37.0, 37.0, 37.0]
[23.0, 23.0, 23.0, 23.0]
[44.0, 44.0, 44.0, 44.0]

None

None

None

In [71]:
# Check Outlier
display(    
    get_lower_upper(df_train['Age']),
    print(),
    get_lower_upper(df_test['Age'])
)

(-3.0, 69.0)

None

(-0.5, 67.5)

In [72]:
# Check df_test min:-500,
lower = get_lower_upper(df_test['Age'])[0]
df_test['Age'] = df_test['Age'].apply(lambda x: np.NaN if x < lower else x)

In [73]:
Reassign_Group_Numeric_Wrong_Values(df_test, 'Customer_ID', 'Age')

Existing Min, Max Values:
min   14.000
max   56.000
Name: Age, dtype: float64

by Customer_ID's Actual min, max Values:
min:	14.0,
max:	56.0

Before Assigning Min, Max Age: ['No NaN Value']

Before Assigning Example Age:

[38.0, 38.0, 38.0, 38.0]
[48.0, 48.0, 48.0, 49.0]
[37.0, 37.0, 37.0, 37.0]
[23.0, 23.0, 23.0, 23.0]
[44.0, 44.0, 44.0, 44.0]

After Assigning  Min, Max Age: ['No NaN Value']

After Assigning Example Age:

[38.0, 38.0, 38.0, 38.0]
[48.0, 48.0, 48.0, 49.0]
[37.0, 37.0, 37.0, 37.0]
[23.0, 23.0, 23.0, 23.0]
[44.0, 44.0, 44.0, 44.0]

In [74]:
df_train.SSN.value_counts(dropna=False)

NaN              5572
78735990.000        8
486783816.000       8
750677525.000       8
903500305.000       8
                 ...
856066147.000       4
753722651.000       4
331281921.000       4
604626133.000       4
286449634.000       4
Name: SSN, Length: 12501, dtype: int64

In [75]:
df_train["SSN"] = df_train.groupby("Customer_ID")["SSN"].fillna(method="bfill").fillna(method="ffill")
df_test["SSN"] = df_test.groupby("Customer_ID")["SSN"].fillna(method="bfill").fillna(method="ffill")

In [76]:
df_train.Annual_Income.value_counts(dropna=False)

17816.750       16
22434.160       16
40341.160       16
17273.830       16
109945.320      16
                ..
17079092.000     1
1910572.000      1
20179076.000     1
7980216.000      1
8299495.000      1
Name: Annual_Income, Length: 13487, dtype: int64

In [77]:
display(    
    Reassign_Group_Numeric_Wrong_Values(df_train, 'Customer_ID', 'Annual_Income'),
    print(),
    Reassign_Group_Numeric_Wrong_Values(df_test, 'Customer_ID', 'Annual_Income')
)

Existing Min, Max Values:
min       7005.930
max   24198062.000
Name: Annual_Income, dtype: float64

by Customer_ID's Actual min, max Values:
min:	7005.93,
max:	179987.28

Before Assigning Min, Max Annual_Income: ['No NaN Value']

Before Assigning Example Annual_Income:

[16756.18, 16756.18, 16756.18, 16756.18, 16756.18, 16756.18, 16756.18, 16756.18]
[21212.91, 21212.91, 21212.91, 21212.91, 21212.91, 21212.91, 21212.91, 21212.91]
[33540.43, 33540.43, 33540.43, 33540.43, 33540.43, 33540.43, 33540.43, 33540.43]
[80983.64, 80983.64, 80983.64, 80983.64, 80983.64, 80983.64, 80983.64, 80983.64]
[104142.56, 104142.56, 104142.56, 104142.56, 104142.56, 104142.56, 104142.56, 104142.56]

After Assigning  Min, Max Annual_Income: ['No NaN Value']

After Assigning Example Annual_Income:

[16756.18, 16756.18, 16756.18, 16756.18, 16756.18, 16756.18, 16756.18, 16756.18]
[21212.91, 21212.91, 21212.91, 21212.91, 21212.91, 21212.91, 21212.91, 21212.91]
[33540.43, 33540.43, 33540.43, 33540.43, 33540.43, 33540.43, 33540.43, 33540.43]
[80983.64, 80983.64, 80983.64, 80983.64, 80983.64, 80983.64, 80983.64, 80983.64]
[104142.56, 104142.56, 104142.56, 104142.56, 104142.56, 104142.56, 104142.56, 104142.56]


Existing Min, Max Values:
min       7005.930
max   24137255.000
Name: Annual_Income, dtype: float64

by Customer_ID's Actual min, max Values:
min:	7005.93,
max:	179987.28

Before Assigning Min, Max Annual_Income: ['No NaN Value']

Before Assigning Example Annual_Income:

[16756.18, 16756.18, 16756.18, 16756.18]
[21212.91, 21212.91, 21212.91, 21212.91]
[33540.43, 33540.43, 33540.43, 33540.43]
[80983.64, 80983.64, 80983.64, 80983.64]
[104142.56, 104142.56, 104142.56, 104142.56]

After Assigning  Min, Max Annual_Income: ['No NaN Value']

After Assigning Example Annual_Income:

[16756.18, 16756.18, 16756.18, 16756.18]
[21212.91, 21212.91, 21212.91, 21212.91]
[33540.43, 33540.43, 33540.43, 33540.43]
[80983.64, 80983.64, 80983.64, 80983.64]
[104142.56, 104142.56, 104142.56, 104142.56]

None

None

None

In [78]:
# Check Outlier
display(    
    get_lower_upper(df_train['Annual_Income']),
    print(),
    get_lower_upper(df_test['Annual_Income'])
)

(-59167.77374999999, 150194.21625)

None

(-59167.77374999999, 150194.21625)

In [79]:
df_train.Monthly_Inhand_Salary.value_counts(dropna=False)

NaN         15002
2295.058       15
6082.188       15
6769.130       15
6358.957       15
            ...
1087.546        1
3189.212        1
5640.118        1
7727.560        1
2443.654        1
Name: Monthly_Inhand_Salary, Length: 13236, dtype: int64

In [80]:
display(    
    Reassign_Group_Numeric_Wrong_Values(df_train, 'Customer_ID', 'Monthly_Inhand_Salary'),
    print(),
    Reassign_Group_Numeric_Wrong_Values(df_test, 'Customer_ID', 'Monthly_Inhand_Salary')
)

Existing Min, Max Values:
min     303.645
max   15204.633
Name: Monthly_Inhand_Salary, dtype: float64

by Customer_ID's Actual min, max Values:
min:	303.6454166666666,
max:	15204.633333333331

Before Assigning Min, Max Monthly_Inhand_Salary: ['No NaN Value']

Before Assigning Example Monthly_Inhand_Salary:

[1331.3483333333334, 1331.3483333333334, 1331.3483333333334, 1331.3483333333334, 1331.3483333333334, 1331.3483333333334, 1331.3483333333334, 1331.3483333333334]
[1496.7425, 1496.7425, 1496.7425, 1496.7425, nan, 1496.7425, 1496.7425, 1496.7425]
[2655.035833333333, 2655.035833333333, 2655.035833333333, 2655.035833333333, 2655.035833333333, 2655.035833333333, 2655.035833333333, 2655.035833333333]
[6692.636666666666, 6692.636666666666, 6692.636666666666, 6692.636666666666, 6692.636666666666, 6692.636666666666, 6692.636666666666, 6692.636666666666]
[8433.546666666667, 8433.546666666667, 8433.546666666667, 8433.546666666667, 8433.546666666667, 8433.546666666667, 8433.546666666667, nan]

After Assigning  Min, Max Monthly_Inhand_Salary: ['No NaN Value']

After Assigning Example Monthly_Inhand_Salary:

[1331.3483333333334, 1331.3483333333334, 1331.3483333333334, 1331.3483333333334, 1331.3483333333334, 1331.3483333333334, 1331.3483333333334, 1331.3483333333334]
[1496.7425, 1496.7425, 1496.7425, 1496.7425, 1496.7425, 1496.7425, 1496.7425, 1496.7425]
[2655.035833333333, 2655.035833333333, 2655.035833333333, 2655.035833333333, 2655.035833333333, 2655.035833333333, 2655.035833333333, 2655.035833333333]
[6692.636666666666, 6692.636666666666, 6692.636666666666, 6692.636666666666, 6692.636666666666, 6692.636666666666, 6692.636666666666, 6692.636666666666]
[8433.546666666667, 8433.546666666667, 8433.546666666667, 8433.546666666667, 8433.546666666667, 8433.546666666667, 8433.546666666667, 8433.546666666667]


Existing Min, Max Values:
min     303.645
max   15204.633
Name: Monthly_Inhand_Salary, dtype: float64

by Customer_ID's Actual min, max Values:
min:	303.6454166666666,
max:	15204.633333333331

Before Assigning Min, Max Monthly_Inhand_Salary: ['No NaN Value']

Before Assigning Example Monthly_Inhand_Salary:

[1331.3483333333334, 1331.3483333333334, nan, 1331.3483333333334]
[1496.7425, 1496.7425, 1496.7425, 1496.7425]
[2655.035833333333, 2655.035833333333, 2655.035833333333, 2655.035833333333]
[6692.636666666666, 6692.636666666666, 6692.636666666666, 6692.636666666666]
[8433.546666666667, 8433.546666666667, 8433.546666666667, nan]

After Assigning  Min, Max Monthly_Inhand_Salary: ['No NaN Value']

After Assigning Example Monthly_Inhand_Salary:

[1331.3483333333334, 1331.3483333333334, 1331.3483333333334, 1331.3483333333334]
[1496.7425, 1496.7425, 1496.7425, 1496.7425]
[2655.035833333333, 2655.035833333333, 2655.035833333333, 2655.035833333333]
[6692.636666666666, 6692.636666666666, 6692.636666666666, 6692.636666666666]
[8433.546666666667, 8433.546666666667, 8433.546666666667, 8433.546666666667]

None

None

None

In [81]:
# Check Outlier
display(    
    get_lower_upper(df_train['Monthly_Inhand_Salary']),
    print(),
    get_lower_upper(df_test['Monthly_Inhand_Salary'])
)

(-4875.552083333334, 12463.95125)

None

(-4846.678333333333, 12406.855)

In [82]:
df_train.Num_Bank_Accounts.value_counts(dropna=False)

6       13001
7       12823
8       12765
4       12186
5       12118
        ...
1626        1
1470        1
887         1
211         1
697         1
Name: Num_Bank_Accounts, Length: 943, dtype: int64

In [83]:
display(    
    Reassign_Group_Numeric_Wrong_Values(df_train, 'Customer_ID', 'Num_Bank_Accounts'),
    print(),
    Reassign_Group_Numeric_Wrong_Values(df_test, 'Customer_ID', 'Num_Bank_Accounts')
)

Existing Min, Max Values:
min      -1
max    1798
Name: Num_Bank_Accounts, dtype: int64

by Customer_ID's Actual min, max Values:
min:	-1,
max:	10

Before Assigning Min, Max Num_Bank_Accounts: ['No NaN Value']

Before Assigning Example Num_Bank_Accounts:

[9, 9, 9, 9, 9, 9, 9, 9]
[3, 3, 3, 1174, 3, 3, 3, 3]
[6, 6, 6, 6, 6, 6, 6, 6]
[6, 6, 6, 6, 6, 6, 6, 6]
[3, 3, 3, 3, 3, 3, 3, 3]

After Assigning  Min, Max Num_Bank_Accounts: ['No NaN Value']

After Assigning Example Num_Bank_Accounts:

[9.0, 9.0, 9.0, 9.0, 9.0, 9.0, 9.0, 9.0]
[3.0, 3.0, 3.0, 3.0, 3.0, 3.0, 3.0, 3.0]
[6.0, 6.0, 6.0, 6.0, 6.0, 6.0, 6.0, 6.0]
[6.0, 6.0, 6.0, 6.0, 6.0, 6.0, 6.0, 6.0]
[3.0, 3.0, 3.0, 3.0, 3.0, 3.0, 3.0, 3.0]


Existing Min, Max Values:
min      -1
max    1798
Name: Num_Bank_Accounts, dtype: int64

by Customer_ID's Actual min, max Values:
min:	-1,
max:	11

Before Assigning Min, Max Num_Bank_Accounts: ['No NaN Value']

Before Assigning Example Num_Bank_Accounts:

[9, 9, 9, 9]
[3, 3, 3, 3]
[6, 6, 6, 6]
[6, 6, 6, 6]
[3, 3, 3, 3]

After Assigning  Min, Max Num_Bank_Accounts: ['No NaN Value']

After Assigning Example Num_Bank_Accounts:

[9.0, 9.0, 9.0, 9.0]
[3.0, 3.0, 3.0, 3.0]
[6.0, 6.0, 6.0, 6.0]
[6.0, 6.0, 6.0, 6.0]
[3.0, 3.0, 3.0, 3.0]

None

None

None

In [84]:
# Check Outlier
display(    
    get_lower_upper(df_train['Num_Bank_Accounts']),
    print(),
    get_lower_upper(df_test['Num_Bank_Accounts'])
)

(-3.0, 13.0)

None

(-3.0, 13.0)

In [85]:
df_train.Num_Credit_Card.value_counts(dropna=False)

5       18459
7       16615
6       16559
4       14030
3       13277
        ...
791         1
1118        1
657         1
640         1
679         1
Name: Num_Credit_Card, Length: 1179, dtype: int64

In [86]:
display(    
    Reassign_Group_Numeric_Wrong_Values(df_train, 'Customer_ID', 'Num_Credit_Card'),
    print(),
    Reassign_Group_Numeric_Wrong_Values(df_test, 'Customer_ID', 'Num_Credit_Card')
)

Existing Min, Max Values:
min       0
max    1499
Name: Num_Credit_Card, dtype: int64

by Customer_ID's Actual min, max Values:
min:	0,
max:	11

Before Assigning Min, Max Num_Credit_Card: ['No NaN Value']

Before Assigning Example Num_Credit_Card:

[6, 6, 6, 6, 6, 6, 6, 6]
[4, 4, 4, 4, 4, 4, 4, 888]
[3, 3, 3, 3, 3, 3, 3, 3]
[3, 3, 3, 3, 725, 3, 3, 3]
[5, 5, 5, 5, 5, 5, 5, 5]

After Assigning  Min, Max Num_Credit_Card: ['No NaN Value']

After Assigning Example Num_Credit_Card:

[6.0, 6.0, 6.0, 6.0, 6.0, 6.0, 6.0, 6.0]
[4.0, 4.0, 4.0, 4.0, 4.0, 4.0, 4.0, 4.0]
[3.0, 3.0, 3.0, 3.0, 3.0, 3.0, 3.0, 3.0]
[3.0, 3.0, 3.0, 3.0, 3.0, 3.0, 3.0, 3.0]
[5.0, 5.0, 5.0, 5.0, 5.0, 5.0, 5.0, 5.0]


Existing Min, Max Values:
min       0
max    1499
Name: Num_Credit_Card, dtype: int64

by Customer_ID's Actual min, max Values:
min:	0,
max:	11

Before Assigning Min, Max Num_Credit_Card: ['No NaN Value']

Before Assigning Example Num_Credit_Card:

[6, 6, 6, 750]
[4, 4, 4, 4]
[3, 3, 3, 112]
[3, 3, 3, 3]
[5, 5, 5, 5]

After Assigning  Min, Max Num_Credit_Card: ['No NaN Value']

After Assigning Example Num_Credit_Card:

[6.0, 6.0, 6.0, 6.0]
[4.0, 4.0, 4.0, 4.0]
[3.0, 3.0, 3.0, 3.0]
[3.0, 3.0, 3.0, 3.0]
[5.0, 5.0, 5.0, 5.0]

None

None

None

In [87]:
# Check Outlier
display(    
    get_lower_upper(df_train['Num_Credit_Card']),
    print(),
    get_lower_upper(df_test['Num_Credit_Card'])
)

(-0.5, 11.5)

None

(-0.5, 11.5)

In [88]:
df_train.Interest_Rate.value_counts(dropna=False)

8       5012
5       4979
6       4721
12      4540
10      4540
        ...
4995       1
1899       1
2120       1
5762       1
5729       1
Name: Interest_Rate, Length: 1750, dtype: int64

In [89]:
display(    
    Reassign_Group_Numeric_Wrong_Values(df_train, 'Customer_ID', 'Interest_Rate'),
    print(),
    Reassign_Group_Numeric_Wrong_Values(df_test, 'Customer_ID', 'Interest_Rate')
)

Existing Min, Max Values:
min       1
max    5797
Name: Interest_Rate, dtype: int64

by Customer_ID's Actual min, max Values:
min:	1,
max:	34

Before Assigning Min, Max Interest_Rate: ['No NaN Value']

Before Assigning Example Interest_Rate:

[22, 22, 22, 22, 22, 22, 22, 22]
[10, 10, 10, 10, 10, 10, 10, 10]
[17, 17, 17, 17, 17, 17, 17, 17]
[15, 15, 15, 15, 15, 15, 15, 15]
[5, 5, 5, 5, 5, 5, 5, 5]

After Assigning  Min, Max Interest_Rate: ['No NaN Value']

After Assigning Example Interest_Rate:

[22.0, 22.0, 22.0, 22.0, 22.0, 22.0, 22.0, 22.0]
[10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0]
[17.0, 17.0, 17.0, 17.0, 17.0, 17.0, 17.0, 17.0]
[15.0, 15.0, 15.0, 15.0, 15.0, 15.0, 15.0, 15.0]
[5.0, 5.0, 5.0, 5.0, 5.0, 5.0, 5.0, 5.0]


Existing Min, Max Values:
min       1
max    5799
Name: Interest_Rate, dtype: int64

by Customer_ID's Actual min, max Values:
min:	1,
max:	34

Before Assigning Min, Max Interest_Rate: ['No NaN Value']

Before Assigning Example Interest_Rate:

[22, 22, 22, 22]
[10, 10, 10, 10]
[17, 17, 17, 17]
[15, 15, 15, 15]
[5, 5, 5, 5]

After Assigning  Min, Max Interest_Rate: ['No NaN Value']

After Assigning Example Interest_Rate:

[22.0, 22.0, 22.0, 22.0]
[10.0, 10.0, 10.0, 10.0]
[17.0, 17.0, 17.0, 17.0]
[15.0, 15.0, 15.0, 15.0]
[5.0, 5.0, 5.0, 5.0]

None

None

None

In [90]:
# Check Outlier
display(    
    get_lower_upper(df_train['Interest_Rate']),
    print(),
    get_lower_upper(df_test['Interest_Rate'])
)

(-12.5, 39.5)

None

(-12.5, 39.5)

In [91]:
df_train.Num_of_Loan.value_counts(dropna=False)

3       15104
2       15032
4       14743
0       10930
1       10606
        ...
119         1
321         1
1439        1
663         1
966         1
Name: Num_of_Loan, Length: 414, dtype: int64

In [92]:
display(    
    Reassign_Group_Numeric_Wrong_Values(df_train, 'Customer_ID', 'Num_of_Loan'),
    print(),
    Reassign_Group_Numeric_Wrong_Values(df_test, 'Customer_ID', 'Num_of_Loan')
)

Existing Min, Max Values:
min    -100
max    1496
Name: Num_of_Loan, dtype: int64

by Customer_ID's Actual min, max Values:
min:	0,
max:	9

Before Assigning Min, Max Num_of_Loan: ['No NaN Value']

Before Assigning Example Num_of_Loan:

[2, 2, 2, 2, 2, 2, 2, 2]
[3, 3, 3, 3, -100, 3, 3, 3]
[0, 0, 0, 0, 0, 0, 0, 0]
[4, 4, 4, 4, 4, 4, 4, 4]
[3, 3, 3, 3, 3, 3, 3, 3]

After Assigning  Min, Max Num_of_Loan: ['No NaN Value']

After Assigning Example Num_of_Loan:

[2.0, 2.0, 2.0, 2.0, 2.0, 2.0, 2.0, 2.0]
[3.0, 3.0, 3.0, 3.0, 3.0, 3.0, 3.0, 3.0]
[0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]
[4.0, 4.0, 4.0, 4.0, 4.0, 4.0, 4.0, 4.0]
[3.0, 3.0, 3.0, 3.0, 3.0, 3.0, 3.0, 3.0]


Existing Min, Max Values:
min    -100
max    1496
Name: Num_of_Loan, dtype: int64

by Customer_ID's Actual min, max Values:
min:	-100,
max:	9

Before Assigning Min, Max Num_of_Loan: ['No NaN Value']

Before Assigning Example Num_of_Loan:

[2, 2, 2, -100]
[3, 3, 3, 3]
[0, 0, 0, 0]
[4, 4, 4, 4]
[3, 3, 3, 3]

After Assigning  Min, Max Num_of_Loan: ['No NaN Value']

After Assigning Example Num_of_Loan:

[2.0, 2.0, 2.0, -100.0]
[3.0, 3.0, 3.0, 3.0]
[0.0, 0.0, 0.0, 0.0]
[4.0, 4.0, 4.0, 4.0]
[3.0, 3.0, 3.0, 3.0]

None

None

None

In [93]:
# Check Outlier
display(    
    get_lower_upper(df_train['Num_of_Loan']),
    print(),
    get_lower_upper(df_test['Num_of_Loan'])
)

(-2.5, 9.5)

None

(-5.0, 11.0)

In [94]:
lower = get_lower_upper(df_test['Num_of_Loan'])[0]
df_test['Num_of_Loan'] = df_test['Num_of_Loan'].apply(lambda x: np.NaN if x<lower else x)

In [95]:
Reassign_Group_Numeric_Wrong_Values(df_test, 'Customer_ID', 'Num_of_Loan')

Existing Min, Max Values:
min   0.000
max   9.000
Name: Num_of_Loan, dtype: float64

by Customer_ID's Actual min, max Values:
min:	0.0,
max:	9.0

Before Assigning Min, Max Num_of_Loan: ['No NaN Value']

Before Assigning Example Num_of_Loan:

[2.0, 2.0, 2.0, nan]
[3.0, 3.0, 3.0, 3.0]
[0.0, 0.0, 0.0, 0.0]
[4.0, 4.0, 4.0, 4.0]
[3.0, 3.0, 3.0, 3.0]

After Assigning  Min, Max Num_of_Loan: ['No NaN Value']

After Assigning Example Num_of_Loan:

[2.0, 2.0, 2.0, 2.0]
[3.0, 3.0, 3.0, 3.0]
[0.0, 0.0, 0.0, 0.0]
[4.0, 4.0, 4.0, 4.0]
[3.0, 3.0, 3.0, 3.0]

In [96]:
df_test.Delay_from_due_date.value_counts(dropna=False)

 13    1761
 15    1759
 8     1680
 9     1656
 10    1645
 14    1636
 12    1625
 7     1587
 6     1584
 11    1573
 5     1495
 18    1335
 19    1310
 27    1308
 20    1300
 25    1289
 16    1284
 21    1230
 26    1226
 28    1223
 29    1223
 24    1214
 17    1183
 23    1165
 22    1135
 30    1115
 3      848
 4      825
 2      669
 1      668
 0      626
 32     402
 31     397
 33     381
 48     363
 47     321
 34     320
 54     308
 41     307
 38     306
 42     303
 52     302
 44     299
 35     298
 55     296
 53     291
 56     283
 58     282
 62     279
 36     279
 40     272
 61     271
 50     270
 45     269
 57     269
 49     269
 37     267
 60     259
 46     258
 43     253
 39     250
 59     250
 51     248
-1      101
-2       71
-3       59
-4       49
 64      33
 65      30
 63      21
-5       18
 66      12
 67       7
Name: Delay_from_due_date, dtype: int64

In [97]:
display(    
    Reassign_Group_Numeric_Wrong_Values(df_train, 'Customer_ID', 'Delay_from_due_date'),
    print(),
    Reassign_Group_Numeric_Wrong_Values(df_test, 'Customer_ID', 'Delay_from_due_date')
)

Existing Min, Max Values:
min    -5
max    67
Name: Delay_from_due_date, dtype: int64

by Customer_ID's Actual min, max Values:
min:	-5,
max:	62

Before Assigning Min, Max Delay_from_due_date: ['No NaN Value']

Before Assigning Example Delay_from_due_date:

[48, 48, 48, 48, 48, 48, 48, 48]
[19, 19, 19, 19, 19, 19, 19, 16]
[25, 28, 22, 26, 26, 26, 26, 26]
[19, 19, 19, 19, 19, 19, 19, 19]
[15, 15, 20, 16, 20, 20, 20, 24]

After Assigning  Min, Max Delay_from_due_date: ['No NaN Value']

After Assigning Example Delay_from_due_date:

[48.0, 48.0, 48.0, 48.0, 48.0, 48.0, 48.0, 48.0]
[19.0, 19.0, 19.0, 19.0, 19.0, 19.0, 19.0, 16.0]
[25.0, 28.0, 22.0, 26.0, 26.0, 26.0, 26.0, 26.0]
[19.0, 19.0, 19.0, 19.0, 19.0, 19.0, 19.0, 19.0]
[15.0, 15.0, 20.0, 16.0, 20.0, 20.0, 20.0, 24.0]


Existing Min, Max Values:
min    -5
max    67
Name: Delay_from_due_date, dtype: int64

by Customer_ID's Actual min, max Values:
min:	-5,
max:	62

Before Assigning Min, Max Delay_from_due_date: ['No NaN Value']

Before Assigning Example Delay_from_due_date:

[48, 50, 48, 53]
[20, 19, 15, 19]
[26, 26, 21, 26]
[19, 18, 21, 19]
[25, 20, 20, 20]

After Assigning  Min, Max Delay_from_due_date: ['No NaN Value']

After Assigning Example Delay_from_due_date:

[48.0, 50.0, 48.0, 53.0]
[20.0, 19.0, 15.0, 19.0]
[26.0, 26.0, 21.0, 26.0]
[19.0, 18.0, 21.0, 19.0]
[25.0, 20.0, 20.0, 20.0]

None

None

None

In [98]:
# Check Outlier
display(    
    get_lower_upper(df_train['Delay_from_due_date']),
    print(),
    get_lower_upper(df_test['Delay_from_due_date'])
)

(-17.0, 55.0)

None

(-17.0, 55.0)

In [99]:
df_test.Num_of_Delayed_Payment.value_counts(dropna=False)

NaN         3498
19.000      2707
15.000      2674
16.000      2637
17.000      2636
            ...
1146.000       1
288.000        1
3556.000       1
3393.000       1
2034.000       1
Name: Num_of_Delayed_Payment, Length: 412, dtype: int64

In [100]:
display(    
    Reassign_Group_Numeric_Wrong_Values(df_train, 'Customer_ID', 'Num_of_Delayed_Payment'),
    print(),
    Reassign_Group_Numeric_Wrong_Values(df_test, 'Customer_ID', 'Num_of_Delayed_Payment')
)

Existing Min, Max Values:
min     -3.000
max   4397.000
Name: Num_of_Delayed_Payment, dtype: float64

by Customer_ID's Actual min, max Values:
min:	-2.0,
max:	28.0

Before Assigning Min, Max Num_of_Delayed_Payment: ['No NaN Value']

Before Assigning Example Num_of_Delayed_Payment:

[10.0, 12.0, 12.0, 13.0, nan, 12.0, 11.0, 12.0]
[19.0, 19.0, 19.0, 19.0, 19.0, 21.0, 20.0, 19.0]
[11.0, 11.0, 11.0, nan, 11.0, nan, 11.0, 13.0]
[18.0, 18.0, 18.0, 18.0, 18.0, nan, 20.0, 18.0]
[17.0, 16.0, 14.0, nan, 17.0, 14.0, 11.0, 14.0]

After Assigning  Min, Max Num_of_Delayed_Payment: ['No NaN Value']

After Assigning Example Num_of_Delayed_Payment:

[10.0, 12.0, 12.0, 13.0, 12.0, 12.0, 11.0, 12.0]
[19.0, 19.0, 19.0, 19.0, 19.0, 21.0, 20.0, 19.0]
[11.0, 11.0, 11.0, 11.0, 11.0, 11.0, 11.0, 13.0]
[18.0, 18.0, 18.0, 18.0, 18.0, 18.0, 20.0, 18.0]
[17.0, 16.0, 14.0, 14.0, 17.0, 14.0, 11.0, 14.0]


Existing Min, Max Values:
min     -3.000
max   4399.000
Name: Num_of_Delayed_Payment, dtype: float64

by Customer_ID's Actual min, max Values:
min:	-3.0,
max:	28.0

Before Assigning Min, Max Num_of_Delayed_Payment: ['No NaN Value']

Before Assigning Example Num_of_Delayed_Payment:

[12.0, 12.0, 11.0, 12.0]
[19.0, 18.0, 19.0, 20.0]
[12.0, 11.0, 13.0, 11.0]
[18.0, 18.0, nan, nan]
[14.0, 14.0, 17.0, 12.0]

After Assigning  Min, Max Num_of_Delayed_Payment: ['No NaN Value']

After Assigning Example Num_of_Delayed_Payment:

[12.0, 12.0, 11.0, 12.0]
[19.0, 18.0, 19.0, 20.0]
[12.0, 11.0, 13.0, 11.0]
[18.0, 18.0, 18.0, 18.0]
[14.0, 14.0, 17.0, 12.0]

None

None

None

In [101]:
# Check Outlier
display(    
    get_lower_upper(df_train['Num_of_Delayed_Payment']),
    print(),
    get_lower_upper(df_test['Num_of_Delayed_Payment'])
)

(-4.5, 31.5)

None

(-4.5, 31.5)

In [102]:
df_train.Changed_Credit_Limit.value_counts(dropna=False)

NaN       2091
8.220      133
11.500     127
11.320     126
7.350      121
          ...
-1.840       1
0.890        1
28.060       1
1.560        1
21.170       1
Name: Changed_Credit_Limit, Length: 4384, dtype: int64

In [103]:
display(    
    Reassign_Group_Numeric_Wrong_Values(df_train, 'Customer_ID', 'Changed_Credit_Limit'),
    print(),
    Reassign_Group_Numeric_Wrong_Values(df_test, 'Customer_ID', 'Changed_Credit_Limit')
)

Existing Min, Max Values:
min   -6.490
max   36.970
Name: Changed_Credit_Limit, dtype: float64

by Customer_ID's Actual min, max Values:
min:	-5.01,
max:	29.98

Before Assigning Min, Max Changed_Credit_Limit: ['No NaN Value']

Before Assigning Example Changed_Credit_Limit:

[10.66, 10.66, 10.66, 10.66, 10.66, 10.66, 10.66, 10.66]
[12.13, 5.13, 5.13, 5.13, 5.13, 2.13, 5.13, 5.13]
[14.11, 14.11, 14.11, 14.11, 14.11, 14.11, 14.11, 14.11]
[16.91, 16.91, 16.91, 16.91, 16.91, 16.91, 19.91, 16.91]
[15.28, 15.28, 15.28, 15.28, 19.28, 15.28, 15.28, 15.28]

After Assigning  Min, Max Changed_Credit_Limit: ['No NaN Value']

After Assigning Example Changed_Credit_Limit:

[10.66, 10.66, 10.66, 10.66, 10.66, 10.66, 10.66, 10.66]
[12.13, 5.13, 5.13, 5.13, 5.13, 2.13, 5.13, 5.13]
[14.11, 14.11, 14.11, 14.11, 14.11, 14.11, 14.11, 14.11]
[16.91, 16.91, 16.91, 16.91, 16.91, 16.91, 19.91, 16.91]
[15.28, 15.28, 15.28, 15.28, 19.28, 15.28, 15.28, 15.28]


Existing Min, Max Values:
min   -6.450
max   36.650
Name: Changed_Credit_Limit, dtype: float64

by Customer_ID's Actual min, max Values:
min:	-6.28,
max:	34.21

Before Assigning Min, Max Changed_Credit_Limit: ['No NaN Value']

Before Assigning Example Changed_Credit_Limit:

[10.66, 10.66, 17.66, 10.66]
[5.13, 5.13, 5.13, 5.13]
[14.11, 14.11, 14.11, 14.11]
[19.91, 16.91, 16.91, 16.91]
[15.28, 15.28, 15.28, 15.28]

After Assigning  Min, Max Changed_Credit_Limit: ['No NaN Value']

After Assigning Example Changed_Credit_Limit:

[10.66, 10.66, 17.66, 10.66]
[5.13, 5.13, 5.13, 5.13]
[14.11, 14.11, 14.11, 14.11]
[19.91, 16.91, 16.91, 16.91]
[15.28, 15.28, 15.28, 15.28]

None

None

None

In [104]:
# Check Outlier
display(    
    get_lower_upper(df_train['Changed_Credit_Limit']),
    print(),
    get_lower_upper(df_test['Changed_Credit_Limit'])
)

(-8.925, 29.115000000000002)

None

(-8.850000000000001, 28.990000000000002)

In [105]:
df_train.Num_Credit_Inquiries.value_counts(dropna=False)

4.000       11271
3.000        8890
6.000        8111
7.000        8058
2.000        8028
            ...
1721.000        1
1750.000        1
2397.000        1
621.000         1
74.000          1
Name: Num_Credit_Inquiries, Length: 1224, dtype: int64

In [106]:
display(    
    Reassign_Group_Numeric_Wrong_Values(df_train, 'Customer_ID', 'Num_Credit_Inquiries'),
    print(),
    Reassign_Group_Numeric_Wrong_Values(df_test, 'Customer_ID', 'Num_Credit_Inquiries')
)

Existing Min, Max Values:
min      0.000
max   2597.000
Name: Num_Credit_Inquiries, dtype: float64

by Customer_ID's Actual min, max Values:
min:	0.0,
max:	17.0

Before Assigning Min, Max Num_Credit_Inquiries: ['No NaN Value']

Before Assigning Example Num_Credit_Inquiries:

[nan, 8.0, 8.0, 8.0, 8.0, 8.0, 8.0, 8.0]
[1.0, 1.0, 1.0, 1.0, 1196.0, 1.0, 1.0, 1.0]
[6.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0]
[7.0, 7.0, 7.0, 7.0, 7.0, 7.0, 7.0, 7.0]
[6.0, 6.0, 6.0, 6.0, 6.0, 6.0, 6.0, 692.0]

After Assigning  Min, Max Num_Credit_Inquiries: ['No NaN Value']

After Assigning Example Num_Credit_Inquiries:

[8.0, 8.0, 8.0, 8.0, 8.0, 8.0, 8.0, 8.0]
[1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0]
[6.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0, 10.0]
[7.0, 7.0, 7.0, 7.0, 7.0, 7.0, 7.0, 7.0]
[6.0, 6.0, 6.0, 6.0, 6.0, 6.0, 6.0, 6.0]


Existing Min, Max Values:
min      0.000
max   2593.000
Name: Num_Credit_Inquiries, dtype: float64

by Customer_ID's Actual min, max Values:
min:	0.0,
max:	17.0

Before Assigning Min, Max Num_Credit_Inquiries: ['No NaN Value']

Before Assigning Example Num_Credit_Inquiries:

[13.0, 13.0, 13.0, 13.0]
[1.0, 5.0, 5.0, 5.0]
[10.0, 10.0, 10.0, 848.0]
[11.0, 11.0, 11.0, 11.0]
[10.0, 10.0, 10.0, 10.0]

After Assigning  Min, Max Num_Credit_Inquiries: ['No NaN Value']

After Assigning Example Num_Credit_Inquiries:

[13.0, 13.0, 13.0, 13.0]
[1.0, 5.0, 5.0, 5.0]
[10.0, 10.0, 10.0, 10.0]
[11.0, 11.0, 11.0, 11.0]
[10.0, 10.0, 10.0, 10.0]

None

None

None

In [107]:
# Check Outlier
display(    
    get_lower_upper(df_train['Num_Credit_Inquiries']),
    print(),
    get_lower_upper(df_test['Num_Credit_Inquiries'])
)

(-4.5, 15.5)

None

(-5.0, 19.0)

In [108]:
df_train.Outstanding_Debt.value_counts(dropna=False)

1109.030    24
1151.700    24
1360.450    24
460.460     24
1058.130    16
            ..
4230.040     8
641.990      8
98.610       8
2614.480     8
502.380      8
Name: Outstanding_Debt, Length: 12203, dtype: int64

In [109]:
display(    
    Reassign_Group_Numeric_Wrong_Values(df_train, 'Customer_ID', 'Outstanding_Debt'),
    print(),
    Reassign_Group_Numeric_Wrong_Values(df_test, 'Customer_ID', 'Outstanding_Debt')
)

Existing Min, Max Values:
min      0.230
max   4998.070
Name: Outstanding_Debt, dtype: float64

by Customer_ID's Actual min, max Values:
min:	0.23,
max:	4998.07

Before Assigning Min, Max Outstanding_Debt: ['No NaN Value']

Before Assigning Example Outstanding_Debt:

[1941.73, 1941.73, 1941.73, 1941.73, 1941.73, 1941.73, 1941.73, 1941.73]
[993.15, 993.15, 993.15, 993.15, 993.15, 993.15, 993.15, 993.15]
[1138.97, 1138.97, 1138.97, 1138.97, 1138.97, 1138.97, 1138.97, 1138.97]
[982.44, 982.44, 982.44, 982.44, 982.44, 982.44, 982.44, 982.44]
[1371.8, 1371.8, 1371.8, 1371.8, 1371.8, 1371.8, 1371.8, 1371.8]

After Assigning  Min, Max Outstanding_Debt: ['No NaN Value']

After Assigning Example Outstanding_Debt:

[1941.73, 1941.73, 1941.73, 1941.73, 1941.73, 1941.73, 1941.73, 1941.73]
[993.15, 993.15, 993.15, 993.15, 993.15, 993.15, 993.15, 993.15]
[1138.97, 1138.97, 1138.97, 1138.97, 1138.97, 1138.97, 1138.97, 1138.97]
[982.44, 982.44, 982.44, 982.44, 982.44, 982.44, 982.44, 982.44]
[1371.8, 1371.8, 1371.8, 1371.8, 1371.8, 1371.8, 1371.8, 1371.8]


Existing Min, Max Values:
min      0.230
max   4998.070
Name: Outstanding_Debt, dtype: float64

by Customer_ID's Actual min, max Values:
min:	0.23,
max:	4998.07

Before Assigning Min, Max Outstanding_Debt: ['No NaN Value']

Before Assigning Example Outstanding_Debt:

[1941.73, 1941.73, 1941.73, 1941.73]
[993.15, 993.15, 993.15, 993.15]
[1138.97, 1138.97, 1138.97, 1138.97]
[982.44, 982.44, 982.44, 982.44]
[1371.8, 1371.8, 1371.8, 1371.8]

After Assigning  Min, Max Outstanding_Debt: ['No NaN Value']

After Assigning Example Outstanding_Debt:

[1941.73, 1941.73, 1941.73, 1941.73]
[993.15, 993.15, 993.15, 993.15]
[1138.97, 1138.97, 1138.97, 1138.97]
[982.44, 982.44, 982.44, 982.44]
[1371.8, 1371.8, 1371.8, 1371.8]

None

None

None

In [110]:
# Check Outlier
display(    
    get_lower_upper(df_train['Outstanding_Debt']),
    print(),
    get_lower_upper(df_test['Outstanding_Debt'])
)

(-1503.7625, 4015.7975)

None

(-1503.7625, 4015.7975)

In [111]:
df_train.Credit_Utilization_Ratio.value_counts(dropna=False)

26.823    1
28.328    1
30.017    1
25.479    1
33.934    1
         ..
30.687    1
38.730    1
30.018    1
27.280    1
34.192    1
Name: Credit_Utilization_Ratio, Length: 100000, dtype: int64

In [112]:
df_train.Credit_Utilization_Ratio.isna().sum()

0

In [113]:
df_train.Credit_History_Age.value_counts(dropna=False)

NaN        9030
191.000     446
232.000     445
233.000     444
215.000     443
           ...
3.000        20
2.000        15
403.000      14
404.000      12
1.000         2
Name: Credit_History_Age, Length: 405, dtype: int64

In [114]:
df_train['Credit_History_Age'] = df_train.groupby('Customer_ID')['Credit_History_Age'].apply(lambda x: x.interpolate().bfill().ffill())
df_test['Credit_History_Age'] = df_test.groupby('Customer_ID')['Credit_History_Age'].apply(lambda x: x.interpolate().bfill().ffill())

In [115]:
# Check Outlier
display(    
    get_lower_upper(df_train['Credit_History_Age']),
    print(),
    get_lower_upper(df_test['Credit_History_Age'])
)

(-93.0, 539.0)

None

(-87.0, 545.0)

In [116]:
df_train.Total_EMI_per_month.value_counts(dropna=False)

0.000        10613
49.575           8
73.533           8
22.961           8
38.661           8
             ...
36408.000        1
23760.000        1
24612.000        1
24325.000        1
58638.000        1
Name: Total_EMI_per_month, Length: 14950, dtype: int64

In [117]:
display(    
    Reassign_Group_Numeric_Wrong_Values(df_train, 'Customer_ID', 'Total_EMI_per_month'),
    print(),
    Reassign_Group_Numeric_Wrong_Values(df_test, 'Customer_ID', 'Total_EMI_per_month')
)

Existing Min, Max Values:
min       0.000
max   82331.000
Name: Total_EMI_per_month, dtype: float64

by Customer_ID's Actual min, max Values:
min:	0.0,
max:	1779.1032538262775

Before Assigning Min, Max Total_EMI_per_month: ['No NaN Value']

Before Assigning Example Total_EMI_per_month:

[27.44208910654816, 27.44208910654816, 27.44208910654816, 27.44208910654816, 27.44208910654816, 27.44208910654816, 27.44208910654816, 32972.0]
[45.74570037068675, 45.74570037068675, 45.74570037068675, 45.74570037068675, 45.74570037068675, 45.74570037068675, 45.74570037068675, 45.74570037068675]
[0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]
[188.45659522353543, 188.45659522353543, 188.45659522353543, 188.45659522353543, 188.45659522353543, 188.45659522353543, 188.45659522353543, 188.45659522353543]
[257.7386460249556, 257.7386460249556, 257.7386460249556, 257.7386460249556, 257.7386460249556, 257.7386460249556, 257.7386460249556, 257.7386460249556]

After Assigning  Min, Max Total_EMI_per_month: ['No NaN Value']

After Assigning Example Total_EMI_per_month:

[27.44208910654816, 27.44208910654816, 27.44208910654816, 27.44208910654816, 27.44208910654816, 27.44208910654816, 27.44208910654816, 27.44208910654816]
[45.74570037068675, 45.74570037068675, 45.74570037068675, 45.74570037068675, 45.74570037068675, 45.74570037068675, 45.74570037068675, 45.74570037068675]
[0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]
[188.45659522353543, 188.45659522353543, 188.45659522353543, 188.45659522353543, 188.45659522353543, 188.45659522353543, 188.45659522353543, 188.45659522353543]
[257.7386460249556, 257.7386460249556, 257.7386460249556, 257.7386460249556, 257.7386460249556, 257.7386460249556, 257.7386460249556, 257.7386460249556]


Existing Min, Max Values:
min       0.000
max   82398.000
Name: Total_EMI_per_month, dtype: float64

by Customer_ID's Actual min, max Values:
min:	0.0,
max:	1779.1032538262775

Before Assigning Min, Max Total_EMI_per_month: ['No NaN Value']

Before Assigning Example Total_EMI_per_month:

[27.44208910654816, 27.44208910654816, 27.44208910654816, 27.44208910654816]
[45.74570037068675, 45.74570037068675, 45.74570037068675, 45.74570037068675]
[0.0, 0.0, 0.0, 0.0]
[188.45659522353543, 188.45659522353543, 188.45659522353543, 188.45659522353543]
[257.7386460249556, 257.7386460249556, 257.7386460249556, 257.7386460249556]

After Assigning  Min, Max Total_EMI_per_month: ['No NaN Value']

After Assigning Example Total_EMI_per_month:

[27.44208910654816, 27.44208910654816, 27.44208910654816, 27.44208910654816]
[45.74570037068675, 45.74570037068675, 45.74570037068675, 45.74570037068675]
[0.0, 0.0, 0.0, 0.0]
[188.45659522353543, 188.45659522353543, 188.45659522353543, 188.45659522353543]
[257.7386460249556, 257.7386460249556, 257.7386460249556, 257.7386460249556]

None

None

None

In [118]:
# Check Outlier
display(    
    get_lower_upper(df_train['Total_EMI_per_month']),
    print(),
    get_lower_upper(df_test['Total_EMI_per_month'])
)

(-147.48001686549193, 323.76380380888094)

None

(-167.00318529561883, 361.53628138659604)

In [119]:
df_train.Amount_invested_monthly.value_counts(dropna=False)

NaN          4479
10000.000    4305
0.000         169
36.662          1
89.738          1
             ...
36.542          1
93.451          1
140.810         1
38.739          1
167.164         1
Name: Amount_invested_monthly, Length: 91050, dtype: int64

In [120]:
display(    
    Reassign_Group_Numeric_Wrong_Values(df_train, 'Customer_ID', 'Amount_invested_monthly'),
    print(),
    Reassign_Group_Numeric_Wrong_Values(df_test, 'Customer_ID', 'Amount_invested_monthly')
)

Existing Min, Max Values:
min       0.000
max   10000.000
Name: Amount_invested_monthly, dtype: float64

by Customer_ID's Actual min, max Values:
min:	0.0,
max:	10000.0

Before Assigning Min, Max Amount_invested_monthly: ['No NaN Value']

Before Assigning Example Amount_invested_monthly:

[45.30106826949194, 90.07842318605292, 61.73271462991577, 56.4949816634165, 51.726244263612, 60.82828780912217, 95.6486475869488, 66.71824831147686]
[30.373471914127194, 44.31995483866171, nan, 62.81248610216079, 148.30956484525, 10000.0, 59.30896122323683, 118.54244614778156]
[118.8806978910128, nan, 337.1997406214716, 170.8689598433119, 74.1980692925824, 105.4573791889266, 197.85037247610126, 165.20443547590202]
[149.37725143584314, 146.97809602243544, 101.12020124815511, 492.3974911743151, 264.1791118544216, 261.69017894140734, 200.64143588981403, 126.07161584554541]
[292.2127037381353, nan, 187.59489650806347, 275.635709774446, 487.8062062008502, nan, 124.29952362711306, 481.7990883470461]

After Assigning  Min, Max Amount_invested_monthly: ['No NaN Value']

After Assigning Example Amount_invested_monthly:

[45.30106826949194, 90.07842318605292, 61.73271462991577, 56.4949816634165, 51.726244263612, 60.82828780912217, 95.6486475869488, 66.71824831147686]
[30.373471914127194, 44.31995483866171, 30.373471914127194, 62.81248610216079, 148.30956484525, 10000.0, 59.30896122323683, 118.54244614778156]
[118.8806978910128, 74.1980692925824, 337.1997406214716, 170.8689598433119, 74.1980692925824, 105.4573791889266, 197.85037247610126, 165.20443547590202]
[149.37725143584314, 146.97809602243544, 101.12020124815511, 492.3974911743151, 264.1791118544216, 261.69017894140734, 200.64143588981403, 126.07161584554541]
[292.2127037381353, 124.29952362711306, 187.59489650806347, 275.635709774446, 487.8062062008502, 124.29952362711306, 124.29952362711306, 481.7990883470461]


Existing Min, Max Values:
min       0.000
max   10000.000
Name: Amount_invested_monthly, dtype: float64

by Customer_ID's Actual min, max Values:
min:	0.0,
max:	10000.0

Before Assigning Min, Max Amount_invested_monthly: ['No NaN Value']

Before Assigning Example Amount_invested_monthly:

[116.54410553197071, 79.08087443658461, 93.81567846791012, 168.43584020560507]
[104.33987358576769, 55.45176127748453, nan, nan]
[50.930150099663045, 86.4414839594447, 351.92301846584564, 55.62866930298164]
[684.6651624547051, 103.13758327637464, 110.66061982791805, 161.67162412887268]
[631.9932676909148, 772.3790958015891, 102.48803392235304, 474.3649639513685]

After Assigning  Min, Max Amount_invested_monthly: ['No NaN Value']

After Assigning Example Amount_invested_monthly:

[116.54410553197071, 79.08087443658461, 93.81567846791012, 168.43584020560507]
[104.33987358576769, 55.45176127748453, 55.45176127748453, 55.45176127748453]
[50.930150099663045, 86.4414839594447, 351.92301846584564, 55.62866930298164]
[684.6651624547051, 103.13758327637464, 110.66061982791805, 161.67162412887268]
[631.9932676909148, 772.3790958015891, 102.48803392235304, 474.3649639513685]

None

None

None

In [121]:
# Check Outlier
display(    
    get_lower_upper(df_train['Amount_invested_monthly']),
    print(),
    get_lower_upper(df_test['Amount_invested_monthly'])
)

(-208.03825932668485, 536.1234129340274)

None

(-207.1988548412891, 538.6990674525657)

In [122]:
df_train['Amount_invested_monthly'].isin([10000.000]).sum(), df_test['Amount_invested_monthly'].isin([10000.000]).sum()

(4471, 2194)

In [123]:
# Drop 10000.000
data = [10000.000]

df_train['Amount_invested_monthly'].replace( data, np.NaN, inplace=True)
df_test['Amount_invested_monthly'].replace( data, np.NaN, inplace=True)

In [124]:
display(    
    Reassign_Group_Numeric_Wrong_Values(df_train, 'Customer_ID', 'Amount_invested_monthly'),
    print(),
    Reassign_Group_Numeric_Wrong_Values(df_test, 'Customer_ID', 'Amount_invested_monthly')
)

Existing Min, Max Values:
min      0.000
max   1977.326
Name: Amount_invested_monthly, dtype: float64

by Customer_ID's Actual min, max Values:
min:	0.0,
max:	510.7262372637133

Before Assigning Min, Max Amount_invested_monthly: ['No NaN Value']

Before Assigning Example Amount_invested_monthly:

[45.30106826949194, 90.07842318605292, 61.73271462991577, 56.4949816634165, 51.726244263612, 60.82828780912217, 95.6486475869488, 66.71824831147686]
[30.373471914127194, 44.31995483866171, 30.373471914127194, 62.81248610216079, 148.30956484525, nan, 59.30896122323683, 118.54244614778156]
[118.8806978910128, 74.1980692925824, 337.1997406214716, 170.8689598433119, 74.1980692925824, 105.4573791889266, 197.85037247610126, 165.20443547590202]
[149.37725143584314, 146.97809602243544, 101.12020124815511, 492.3974911743151, 264.1791118544216, 261.69017894140734, 200.64143588981403, 126.07161584554541]
[292.2127037381353, 124.29952362711306, 187.59489650806347, 275.635709774446, 487.8062062008502, 124.29952362711306, 124.29952362711306, 481.7990883470461]

After Assigning  Min, Max Amount_invested_monthly: ['No NaN Value']

After Assigning Example Amount_invested_monthly:

[45.30106826949194, 90.07842318605292, 61.73271462991577, 56.4949816634165, 51.726244263612, 60.82828780912217, 95.6486475869488, 66.71824831147686]
[30.373471914127194, 44.31995483866171, 30.373471914127194, 62.81248610216079, 148.30956484525, 30.373471914127194, 59.30896122323683, 118.54244614778156]
[118.8806978910128, 74.1980692925824, 337.1997406214716, 170.8689598433119, 74.1980692925824, 105.4573791889266, 197.85037247610126, 165.20443547590202]
[149.37725143584314, 146.97809602243544, 101.12020124815511, 492.3974911743151, 264.1791118544216, 261.69017894140734, 200.64143588981403, 126.07161584554541]
[292.2127037381353, 124.29952362711306, 187.59489650806347, 275.635709774446, 487.8062062008502, 124.29952362711306, 124.29952362711306, 481.7990883470461]


Existing Min, Max Values:
min      0.000
max   1908.124
Name: Amount_invested_monthly, dtype: float64

by Customer_ID's Actual min, max Values:
min:	0.0,
max:	1080.8990680149284

Before Assigning Min, Max Amount_invested_monthly: ['No NaN Value']

Before Assigning Example Amount_invested_monthly:

[116.54410553197071, 79.08087443658461, 93.81567846791012, 168.43584020560507]
[104.33987358576769, 55.45176127748453, 55.45176127748453, 55.45176127748453]
[50.930150099663045, 86.4414839594447, 351.92301846584564, 55.62866930298164]
[684.6651624547051, 103.13758327637464, 110.66061982791805, 161.67162412887268]
[631.9932676909148, 772.3790958015891, 102.48803392235304, 474.3649639513685]

After Assigning  Min, Max Amount_invested_monthly: ['No NaN Value']

After Assigning Example Amount_invested_monthly:

[116.54410553197071, 79.08087443658461, 93.81567846791012, 168.43584020560507]
[104.33987358576769, 55.45176127748453, 55.45176127748453, 55.45176127748453]
[50.930150099663045, 86.4414839594447, 351.92301846584564, 55.62866930298164]
[684.6651624547051, 103.13758327637464, 110.66061982791805, 161.67162412887268]
[631.9932676909148, 772.3790958015891, 102.48803392235304, 474.3649639513685]

None

None

None

In [125]:
df_train.Monthly_Balance.value_counts(dropna=False)

NaN                                 1200
-333333333333333314856026112.000       9
312.494                                1
347.414                                1
254.971                                1
                                    ...
366.289                                1
151.188                                1
306.750                                1
278.872                                1
393.674                                1
Name: Monthly_Balance, Length: 98793, dtype: int64

In [126]:
display(    
    Reassign_Group_Numeric_Wrong_Values(df_train, 'Customer_ID', 'Monthly_Balance'),
    print(),
    Reassign_Group_Numeric_Wrong_Values(df_test, 'Customer_ID', 'Monthly_Balance')
)

Existing Min, Max Values:
min   -333333333333333314856026112.000
max                           1602.041
Name: Monthly_Balance, dtype: float64

by Customer_ID's Actual min, max Values:
min:	-3.333333333333333e+26,
max:	1183.9306960885192

Before Assigning Min, Max Monthly_Balance: ['No NaN Value']

Before Assigning Example Monthly_Balance:

[310.39167595729333, 295.61432104073225, 333.9600295968694, 309.1977625633686, 323.9664999631732, 334.864456417663, 280.04409663983637, 328.97449591530835]
[323.5550777151861, 309.6085947906515, 265.4874646531188, 291.11606352715245, 245.61898478406326, 239.46481499922072, 334.61958840607645, 275.3861034815317]
[406.62288544232047, 350.39351957834924, 218.30384271186168, 354.63462349002145, 441.30551404075095, 420.04620414440666, 337.6532108572321, 370.2991478574313]
[581.4298200072883, 573.8289754206959, 629.6868701949761, 258.40958026881617, 496.6279595887097, 489.116892501724, 560.1656355533173, 594.7354555975859]
[553.4033169035758, 228.71773015063442, 648.0211241336477, 579.9803108672652, 377.809814440861, nan, 701.3164970145981, 383.81693229466515]

After Assigning  Min, Max Monthly_Balance: ['No NaN Value']

After Assigning Example Monthly_Balance:

[310.39167595729333, 295.61432104073225, 333.9600295968694, 309.1977625633686, 323.9664999631732, 334.864456417663, 280.04409663983637, 328.97449591530835]
[323.5550777151861, 309.6085947906515, 265.4874646531188, 291.11606352715245, 245.61898478406326, 239.46481499922072, 334.61958840607645, 275.3861034815317]
[406.62288544232047, 350.39351957834924, 218.30384271186168, 354.63462349002145, 441.30551404075095, 420.04620414440666, 337.6532108572321, 370.2991478574313]
[581.4298200072883, 573.8289754206959, 629.6868701949761, 258.40958026881617, 496.6279595887097, 489.116892501724, 560.1656355533173, 594.7354555975859]
[553.4033169035758, 228.71773015063442, 648.0211241336477, 579.9803108672652, 377.809814440861, 228.71773015063442, 701.3164970145981, 383.81693229466515]


Existing Min, Max Values:
min   -333333333333333314856026112.000
max                           1606.518
Name: Monthly_Balance, dtype: float64

by Customer_ID's Actual min, max Values:
min:	-3.333333333333333e+26,
max:	1348.682942960819

Before Assigning Min, Max Monthly_Balance: ['No NaN Value']

Before Assigning Example Monthly_Balance:

[279.14863869481445, 306.61186979020056, 301.87706575887506, 227.25690402118008]
[279.58867604354555, 318.4767883518287, 260.7342254927612, 307.57591763672826]
[474.5734332336703, 439.0620993738886, 203.58056486748768, 459.8749140303517]
[76.14190898842622, 617.6694881667568, 620.1464516152132, 569.1354473142586]
[223.62275295079644, 93.23692484012213, 723.1279867193582, 401.2510566903428]

After Assigning  Min, Max Monthly_Balance: ['No NaN Value']

After Assigning Example Monthly_Balance:

[279.14863869481445, 306.61186979020056, 301.87706575887506, 227.25690402118008]
[279.58867604354555, 318.4767883518287, 260.7342254927612, 307.57591763672826]
[474.5734332336703, 439.0620993738886, 203.58056486748768, 459.8749140303517]
[76.14190898842622, 617.6694881667568, 620.1464516152132, 569.1354473142586]
[223.62275295079644, 93.23692484012213, 723.1279867193582, 401.2510566903428]

None

None

None

In [127]:
# Check Outlier
display(    
    get_lower_upper(df_train['Monthly_Balance']),
    print(),
    get_lower_upper(df_test['Monthly_Balance'])
)

(-26.41535366651823, 759.1677907892747)

None

(-30.292015924012276, 769.4529720817945)

## END

In [128]:
df_train

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,Num_Credit_Card,Interest_Rate,Num_of_Loan,Type_of_Loan,Delay_from_due_date,Num_of_Delayed_Payment,Changed_Credit_Limit,Num_Credit_Inquiries,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score
0,5634,3392,1,Aaron Maashoh,23.000,821000265.000,Scientist,19114.120,1824.843,3.000,4.000,3.000,4.000,"Auto Loan, Credit-Builder Loan, Personal Loan,...",3.000,7.000,11.270,4.000,Good,809.980,26.823,265.000,No,49.575,80.415,High_spent_Small_value_payments,312.494,Good
1,5635,3392,2,Aaron Maashoh,23.000,821000265.000,Scientist,19114.120,1824.843,3.000,4.000,3.000,4.000,"Auto Loan, Credit-Builder Loan, Personal Loan,...",-1.000,4.000,11.270,4.000,Good,809.980,31.945,266.000,No,49.575,118.280,Low_spent_Large_value_payments,284.629,Good
2,5636,3392,3,Aaron Maashoh,23.000,821000265.000,Scientist,19114.120,1824.843,3.000,4.000,3.000,4.000,"Auto Loan, Credit-Builder Loan, Personal Loan,...",3.000,7.000,11.270,4.000,Good,809.980,28.609,267.000,No,49.575,81.700,Low_spent_Medium_value_payments,331.210,Good
3,5637,3392,4,Aaron Maashoh,23.000,821000265.000,Scientist,19114.120,1824.843,3.000,4.000,3.000,4.000,"Auto Loan, Credit-Builder Loan, Personal Loan,...",5.000,4.000,6.270,4.000,Good,809.980,31.378,268.000,No,49.575,199.458,Low_spent_Small_value_payments,223.451,Good
4,5638,3392,5,Aaron Maashoh,23.000,821000265.000,Scientist,19114.120,1824.843,3.000,4.000,3.000,4.000,"Auto Loan, Credit-Builder Loan, Personal Loan,...",6.000,4.000,11.270,4.000,Good,809.980,24.797,269.000,No,49.575,41.420,High_spent_Medium_value_payments,341.489,Good
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
99995,155625,37932,4,Nicks,25.000,78735990.000,Mechanic,39628.990,3359.416,4.000,6.000,7.000,2.000,"Auto Loan, and Student Loan",23.000,7.000,11.500,3.000,Good,502.380,34.664,378.000,No,35.104,60.971,High_spent_Large_value_payments,479.866,Poor
99996,155626,37932,5,Nicks,25.000,78735990.000,Mechanic,39628.990,3359.416,4.000,6.000,7.000,2.000,"Auto Loan, and Student Loan",18.000,7.000,11.500,3.000,Good,502.380,40.566,379.000,No,35.104,54.186,High_spent_Medium_value_payments,496.652,Poor
99997,155627,37932,6,Nicks,25.000,78735990.000,Mechanic,39628.990,3359.416,4.000,6.000,7.000,2.000,"Auto Loan, and Student Loan",27.000,6.000,11.500,3.000,Good,502.380,41.256,380.000,No,35.104,24.028,High_spent_Large_value_payments,516.809,Poor
99998,155628,37932,7,Nicks,25.000,78735990.000,Mechanic,39628.990,3359.416,4.000,6.000,7.000,2.000,"Auto Loan, and Student Loan",20.000,6.000,11.500,3.000,Good,502.380,33.638,381.000,No,35.104,251.673,Low_spent_Large_value_payments,319.165,Standard
99999,155629,37932,8,Nicks,25.000,78735990.000,Mechanic,39628.990,3359.416,4.000,6.000,7.000,2.000,"Auto Loan, and Student Loan",18.000,6.000,11.500,3.000,Good,502.380,34.192,382.000,No,35.104,167.164,High_spent_Medium_value_payments,393.674,Poor

In [129]:
df_test

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,Num_Credit_Card,Interest_Rate,Num_of_Loan,Type_of_Loan,Delay_from_due_date,Num_of_Delayed_Payment,Changed_Credit_Limit,Num_Credit_Inquiries,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance
0,5642,3392,9,Aaron Maashoh,23.000,821000265.000,Scientist,19114.120,1824.843,3.000,4.000,3.000,4.000,"Auto Loan, Credit-Builder Loan, Personal Loan,...",3.000,7.000,11.270,4.000,Good,809.980,35.030,273.000,No,49.575,236.643,Low_spent_Small_value_payments,186.267
1,5643,3392,10,Aaron Maashoh,24.000,821000265.000,Scientist,19114.120,1824.843,3.000,4.000,3.000,4.000,"Auto Loan, Credit-Builder Loan, Personal Loan,...",3.000,9.000,13.270,4.000,Good,809.980,33.053,274.000,No,49.575,21.465,High_spent_Medium_value_payments,361.444
2,5644,3392,11,Aaron Maashoh,24.000,821000265.000,Scientist,19114.120,1824.843,3.000,4.000,3.000,4.000,"Auto Loan, Credit-Builder Loan, Personal Loan,...",-1.000,4.000,12.270,4.000,Good,809.980,33.812,275.000,No,49.575,148.234,Low_spent_Medium_value_payments,264.675
3,5645,3392,12,Aaron Maashoh,24.000,821000265.000,Scientist,19114.120,1824.843,3.000,4.000,3.000,4.000,"Auto Loan, Credit-Builder Loan, Personal Loan,...",4.000,5.000,11.270,4.000,Good,809.980,32.431,276.000,No,49.575,39.083,High_spent_Medium_value_payments,343.827
4,5654,8625,9,Rick Rothackerj,28.000,4075839.000,Teacher,34847.840,3037.987,2.000,4.000,6.000,1.000,Credit-Builder Loan,3.000,1.000,5.420,5.000,Good,605.030,25.927,327.000,No,18.816,39.684,High_spent_Large_value_payments,485.298
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
49995,155621,34304,12,Sarah McBridec,29.000,31350942.000,Architect,20002.880,1929.907,10.000,8.000,29.000,5.000,"Personal Loan, Auto Loan, Mortgage Loan, Stude...",33.000,25.000,18.310,12.000,Bad,3571.700,34.781,78.000,Yes,60.965,146.486,Low_spent_Small_value_payments,275.540
49996,155630,37932,9,Nicks,25.000,78735990.000,Mechanic,39628.990,3359.416,4.000,6.000,7.000,2.000,"Auto Loan, and Student Loan",20.000,5.000,11.500,7.000,Good,502.380,27.759,383.000,NM,35.104,181.443,Low_spent_Small_value_payments,409.395
49997,155631,37932,10,Nicks,25.000,78735990.000,Mechanic,39628.990,3359.416,4.000,6.000,7.000,2.000,"Auto Loan, and Student Loan",23.000,5.000,13.500,7.000,Good,502.380,36.859,384.000,No,35.104,97.599,Low_spent_Large_value_payments,349.726
49998,155632,37932,11,Nicks,25.000,78735990.000,Mechanic,39628.990,3359.416,4.000,6.000,7.000,2.000,"Auto Loan, and Student Loan",21.000,6.000,11.500,7.000,Good,502.380,39.140,385.000,No,35.104,97.599,High_spent_Small_value_payments,463.239
49999,155633,37932,12,Nicks,25.000,78735990.000,Mechanic,39628.990,3359.416,4.000,6.000,7.000,2.000,"Auto Loan, and Student Loan",22.000,5.000,11.500,7.000,Good,502.380,34.109,386.000,No,35.104,220.458,Low_spent_Medium_value_payments,360.380

In [130]:
display(
    df_train.isna().sum(), 
    print(), 
    df_test.isna().sum()
)

ID                          0
Customer_ID                 0
Month                       0
Name                        0
Age                         0
SSN                         0
Occupation                  0
Annual_Income               0
Monthly_Inhand_Salary       0
Num_Bank_Accounts           0
Num_Credit_Card             0
Interest_Rate               0
Num_of_Loan                 0
Type_of_Loan                0
Delay_from_due_date         0
Num_of_Delayed_Payment      0
Changed_Credit_Limit        0
Num_Credit_Inquiries        0
Credit_Mix                  0
Outstanding_Debt            0
Credit_Utilization_Ratio    0
Credit_History_Age          0
Payment_of_Min_Amount       0
Total_EMI_per_month         0
Amount_invested_monthly     0
Payment_Behaviour           0
Monthly_Balance             0
Credit_Score                0
dtype: int64

None

ID                           0
Customer_ID                  0
Month                        0
Name                         0
Age                          0
SSN                          0
Occupation                   0
Annual_Income                0
Monthly_Inhand_Salary       28
Num_Bank_Accounts            0
Num_Credit_Card              0
Interest_Rate                0
Num_of_Loan                  0
Type_of_Loan                 0
Delay_from_due_date          0
Num_of_Delayed_Payment       4
Changed_Credit_Limit         0
Num_Credit_Inquiries         0
Credit_Mix                   0
Outstanding_Debt             0
Credit_Utilization_Ratio     0
Credit_History_Age           4
Payment_of_Min_Amount        0
Total_EMI_per_month          0
Amount_invested_monthly      4
Payment_Behaviour            0
Monthly_Balance              4
dtype: int64

<a id="10"></a>

<p style="background-color:romance; color:plum; font-size:220%; text-align:center; border-radius:10px 10px; font-family:newtimeroman; line-height: 1.4; font-weight:bold;"><b>The End of the Project</b></p>

<a href="#content" class="btn btn-primary btn-sm" role="button" aria-pressed="true" style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>